-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//stata_logs/create_HHchangeWithRelationships.log
  log type:  text
 opened on:   6 Dec 2019, 14:51:02

. 
. 
. * I would love to turn off line wrap so the state is a single
. * continuous string.  This seems not to be possible.  The best
. * we can do is set the line length to 255.  That's about 20 times
. * too short so why bother.
. *
. * Also, I considered saving the state as a note in the dataset
. * but this generic do file can't assume there is a dataset at all.
. display "Starting random number generator state"
Starting random number generator state

. display "`c(rngstate)'"
XAA0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 000000000000000000000000000000000000000000000000000000000000000000000001000001391839

. 
. 
. set varabbrev off

. 
. macro list
S_FNDATE:        6 Dec 2019 14:51
S_FN:           C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//stata_data/stata_tmp/changer_rels.dta
ReS_Call:       version 15.1:
max_tc:         1
refmon:         4
adult_age:      18
penultimate_wave:
                14
second_wave:    2
final_wave:     15
first_wave:     1
replace:        replace
SIPP08keep:     C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//stata_data/SIPP08_Processed
tempdir:        C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//stata_data/stata_tmp
results:        C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results
sipp2008_logs:  C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//stata_logs
sipp2008_code:  C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//SIPP2008
childhh_base_code:
                C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement/
SIPP2008:       C:\Users\Joanna/Dropbox/Data/SIPP/SIPP2008
SIPP2008core:   C:\Users\Joanna\Dropbox\Data\SIPP\SIPP2008
SIPP2008tm:     C:\Users\Joanna\Dropbox\Data\SIPP\SIPP2008
SIPP08:         C:\Users\Joanna/Dropbox/Data/SIPP/SIPP2008
homedir:        C:\Users\Joanna
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_FLAVOR:       Intercooled
S_OS:           Windows
S_OSDTL:        64-bit
S_MACH:         PC (64-bit x86-64)
_fname:         create_HHchangeWithRelationships
_logdir:        C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//stata_logs
_2:             create_HHchangeWithRelationships
_1:             C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//stata_logs
_0:             "C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//stata_logs" "create_HHchangeWithRelationships"

. 
. pwd
C:\Users\Joanna\Dropbox\Repositories\SIPP_Breadwinning\DemographySupplement

. 
end of do-file

. 
. 
. do "`codedir'/`fname'"

. //====================================================================//
. //===== Children's Household Instability Project                    
. //===== Dataset: SIPP2008                                           
. //===== Purpose: This code merges a file with information on the relationship
. //                 of household members who arrive or leave in the next wave                
. //               to comp_change hh_change and addr_change. And then collapses
. //               to an individual data file with dummy indicators of whether 
. //               ego saw anyone leave, anyone arrive, a parent leave or arrive,
. //               a sibling leave or arrive, anyone else leave or arrive.
. //=====================================================================//
. 
. * hh_change has one record per person per wave
. use "$SIPP08keep/hh_change.dta"

. 
. keep SSUID EPPPNUM SWAVE comp_change hh_change addr_change 

. 
. * changer_rels.dta has one record for every person arriving or leaving ego's 
. * household between this wave and the next. There may be records for both 
. * arrivers and leavers. An "arriver" might be someone that ego moves in with
. * or someone who moves in with ego. Analogously, a leaver could be someone ego
. * leaves ego's household or someone who ego leaves behind when she leaves.   
. 
. * changer_rels includes no records for individuals who experienced no composition change in the wave
. * we get these records from hh_change.dta. Thus any variable we pull in with "changer_rels" is missing for everyone
. * who did not experience a composition change. For example, adult_arrive is missing for everyone with comp_change==0
. merge 1:m SSUID EPPPNUM SWAVE using "$tempdir/changer_rels", keepusing(relationship parent sibling grandparent nonrel other_rel foster allelse adult_arrive adult_leave parent_arrive parent_leave ch
> ange_type)
(note: variable EPPPNUM was int, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,835,344
        from master                 1,835,344  (_merge==1)
        from using                          0  (_merge==2)

    matched                           226,521  (_merge==3)
    -----------------------------------------

. 
. * be sure that all cases with a comp_change were found in changer_rels
. assert _merge==3 if comp_change==1

. 
. drop _merge

. 
. tab  relationship change_type, m

                     |    Indicator for whether this
                     |  person arrive in or left from
                     |         ego's household
        relationship |   arriver     leaver          . |     Total
---------------------+---------------------------------+----------
            BIOCHILD |     9,381     13,211          0 |    22,592 
              BIOMOM |     8,642      7,286          0 |    15,928 
              BIODAD |     6,610      5,935          0 |    12,545 
           STEPCHILD |     2,678      2,974          0 |     5,652 
             STEPMOM |     1,142      1,134          0 |     2,276 
             STEPDAD |     1,742      1,844          0 |     3,586 
          ADOPTCHILD |       205        315          0 |       520 
            ADOPTMOM |       102        147          0 |       249 
            ADOPTDAD |       110        169          0 |       279 
                 MOM |         3          1          0 |         4 
                 DAD |         1          0          0 |         1 
              SPOUSE |     3,999      6,375          0 |    10,374 
          GRANDCHILD |     4,488      5,189          0 |     9,677 
        GRANDCHILD_P |        78         98          0 |       176 
         GRANDPARENT |     5,571      5,198          0 |    10,769 
       GRANDPARENT_P |        97         99          0 |       196 
             SIBLING |    13,281     15,067          0 |    28,348 
             PARTNER |     3,553      2,541          0 |     6,094 
             F_CHILD |       192        200          0 |       392 
               CHILD |       769        613          0 |     1,382 
            F_PARENT |       228        222          0 |       450 
              PARENT |       862        615          0 |     1,477 
           AUNTUNCLE |       857        830          0 |     1,687 
 AUNTUNCLE_OR_PARENT |     2,064      1,907          0 |     3,971 
     GREATGRANDCHILD |        55         67          0 |       122 
    GREATGRANDPARENT |        82         68          0 |       150 
         NEPHEWNIECE |       742        825          0 |     1,567 
CHILD_OR_NEPHEWNIECE |     1,407      1,915          0 |     3,322 
   SIBLING_OR_COUSIN |       941      1,148          0 |     2,089 
               F_SIB |       270        277          0 |       547 
           OTHER_REL |    15,714     18,754          0 |    34,468 
         OTHER_REL_P |       432        467          0 |       899 
               NOREL |    15,584     16,463          0 |    32,047 
            DONTKNOW |     9,896      2,643          0 |    12,539 
                   . |        62         84  1,835,344 | 1,835,490 
---------------------+---------------------------------+----------
               Total |   111,840    114,681  1,835,344 | 2,061,865 

. 
. gen someoneleft=0 if !missing(comp_change)
(774,456 missing values generated)

. gen someonearrived=0 if !missing(comp_change)
(774,456 missing values generated)

. 
. replace someonearrived=1 if change_type==1
(111,840 real changes made)

. replace someoneleft=1 if change_type==2
(114,681 real changes made)

. 
. gen parent_change=1 if comp_change==1 & parent==1
(2,031,719 missing values generated)

. gen sib_change=1 if comp_change==1 & sibling==1
(2,033,517 missing values generated)

. gen other_change=1 if comp_change==1 & parent!=1 & sibling !=1
(1,893,838 missing values generated)

. gen gp_change=1 if comp_change==1 & grandparent==1
(2,051,890 missing values generated)

. gen nonrel_change=1 if comp_change==1 & nonrel==1
(2,015,890 missing values generated)

. gen otherrel_change=1 if comp_change==1 & other_rel==1
(2,002,747 missing values generated)

. gen foster_change=1 if comp_change==1 & foster==1               // tiny
(2,060,476 missing values generated)

. gen allelse_change=1 if comp_change==1 & allelse==1
(2,009,052 missing values generated)

. 
. collapse (max) comp_change parent_change sib_change other_change gp_change nonrel_change otherrel_change foster_change allelse_change adult_arrive adult_leave someonearrived someoneleft parent_arri
> ve parent_leave, by(SSUID EPPPNUM SWAVE)

. 
. merge 1:1 SSUID EPPPNUM SWAVE using "$SIPP08keep/hh_change.dta"
(label etypdad already defined)
(label etypmom already defined)
(label ems already defined)
(label errp already defined)
(label tage already defined)
(label ebornus already defined)
(label race already defined)
(label racealt already defined)
(label sex already defined)
(label comp_change already defined)
(label comp_change_reason already defined)
(label esex already defined)
(label eorigin already defined)
(label educ already defined)
(label addr_change already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,962,765  (_merge==3)
    -----------------------------------------

. 
. drop _merge

. 
. * remove observations that are missing because of lack of interview and
. * unable to infer comp_change. insample is generated at the end of create_hh_change.do
. keep if insample !=0
(773,427 observations deleted)

. 
. local reltyp "parent sib other gp nonrel otherrel foster allelse"

. 
. * set relationship-specific composition change variables to 0 if comp_change is not missing and specific relationship type wasn't observed among the changers.
. foreach r in `reltyp'{
  2.         replace `r'_change=0 if missing(`r'_change) & !missing(comp_change)
  3. }
(1,166,010 real changes made)
(1,165,732 real changes made)
(1,089,179 real changes made)
(1,181,206 real changes made)
(1,159,512 real changes made)
(1,153,971 real changes made)
(1,187,490 real changes made)
(1,145,977 real changes made)

. 
. assert parent_change==. if comp_change==.

. assert parent_change==0 if comp_change==0

. assert other_change==. if comp_change==.

. assert other_change==0 if comp_change==0

. 
. replace adult_arrive=0 if missing(adult_arrive) & !missing(comp_change)
(1,135,336 real changes made)

. replace adult_leave=0 if missing(adult_leave) & !missing(comp_change)
(1,127,500 real changes made)

. 
. replace parent_arrive=0 if missing(parent_arrive) & !missing(comp_change)
(1,178,564 real changes made)

. replace parent_leave=0 if missing(parent_leave) & !missing(comp_change)
(1,175,437 real changes made)

. 
. gen otheradult_arrive=1 if  comp_change==1 & adult_arrive==1 & parent_arrive==0
(1,146,104 missing values generated)

. gen otheradult_leave=1 if  comp_change==1 & adult_leave==1 & parent_leave==0
(1,141,396 missing values generated)

. 
. replace otheradult_arrive=0 if missing(otheradult_arrive) & !missing(comp_change)
(1,145,075 real changes made)

. replace otheradult_leave=0 if missing(otheradult_leave) & !missing(comp_change)
(1,140,367 real changes made)

. 
. save "$SIPP08keep/HHchangeWithRelationships.dta", $replace
(note: file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//stata_data/SIPP08_Processed/HHchangeWithRelationships.dta not found)
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//stata_data/SIPP08_Processed/HHchangeWithRelationships.dta saved

. 
. 
. 
end of do-file

. 
. 
. do "$childhh_base_code/childhh_epilog" "`logdir'" "`fname'"

. * Boilerplate epilog for ChildHH project.
. 
. display "Ending random number generator state"
Ending random number generator state

. display "`c(rngstate)'"
XAA0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
> 000000000000000000000000000000000000000000000000000000000000000000000001000001391839

. log close
      name:  <unnamed>
       log:  C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//stata_logs/create_HHchangeWithRelationships.log
  log type:  text
 closed on:   6 Dec 2019, 14:51:53
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
