-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Joanna/Dropbox\Repositories\SIPP_Breadwinning\DemographySupplement\stata_logs\yearearn_analysis_log.log
  log type:  text
 opened on:  18 Dec 2019, 15:04:45

. 
. *need to add n's to results table
. 
. use "$tempdir/relearn_year.dta", clear

. 
. * select if started observation a mother or became a mother during observation window
. keep if nobsmomminor > 0 
(184,710 observations deleted)

. 
. gen negpinc=1 if year_pearn < 0
(59,765 missing values generated)

. gen neghinc=1 if year_hearn < 0
(59,765 missing values generated)

. 
. * drop cases with negative household income
. drop if neghinc==1
(0 observations deleted)

. 
. * calculate year of first birth with both wave 2 and household roster data
. 
. gen yearb1=.
(59,765 missing values generated)

. gen year=2008

. forvalues y=1/5{
  2.         replace yearb1=2007+`y'-ageoldest if y==`y'
  3.         replace year=2007+`y' if y==`y'
  4. }
(13,419 real changes made)
(0 real changes made)
(10,899 real changes made)
(12,969 real changes made)
(9,469 real changes made)
(11,840 real changes made)
(8,204 real changes made)
(10,791 real changes made)
(7,246 real changes made)
(9,803 real changes made)

. 
. * firstbirth based on transitioning into household with minor child
. * not really sure why ageoldest didn't work.
. replace yearb1=2009 if missing(yearb1) & firstbirth >=2 & firstbirth <=4
(1,923 real changes made)

. replace yearb1=2010 if missing(yearb1) & firstbirth >=5 & firstbirth <=7
(2,146 real changes made)

. replace yearb1=2011 if missing(yearb1) & firstbirth >=8 & firstbirth <=10
(1,654 real changes made)

. replace yearb1=2012 if missing(yearb1) & firstbirth >=11 & firstbirth <=13
(976 real changes made)

. replace yearb1=2013 if missing(yearb1) & firstbirth >=14 & firstbirth <=15
(382 real changes made)

. 
. egen yearbir1=min(yearb1), by(ssuid epppnum)
(349 missing values generated)

. 
. gen durmom=year-tfbrthyr+1 if tfbrthyr > 1900
(11,038 missing values generated)

. replace durmom=year-yearbir1+1 if missing(durmom)
(10,806 real changes made)

. 
. drop if durmom < 0
(7 observations deleted)

. 
. gen ageb1=yearage-durmom
(5,405 missing values generated)

. recode ageb1 (0/17=1)(18/22=2)(23/29=3)(30/56=4), gen(agebir1)
(54323 differences between ageb1 and agebir1)

. 
. *******************************************************************************
. * Basic Descriptive Table 
. *******************************************************************************
. 
. putexcel set "$results/LifetimeBreadwin.xlsx", sheet(Table 1) modify

. putexcel A1="Table 1. Mothers' Earnings Relative to Household Earnings by Partnership Status at Start of Year"
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel B2=("All") C2=("Partnered") D2=("No Partner")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A3=("Personal Earnings(median)")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A4=("Household Earnings(median)")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A5=("Ratio")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A7=("% Breadwinning (> 50%)")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A8=("% Breadwinning(> 60%)")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. * Total 
. sum year_upearn, detail

                         year_upearn
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              56,617
25%            0              0       Sum of Wgt.      56,617

50%        10800                      Mean           20595.47
                        Largest       Std. Dev.      30832.22
75%        30216         462000
90%        54000         483008       Variance       9.51e+08
95%        72744         510400       Skewness       4.293642
99%       128004         574200       Kurtosis       40.14173

. local median_personal: di %9.0fc = r(p50)

. putexcel B3=("`median_personal'")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. sum year_uhearn, detail

                         year_uhearn
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              59,758
25%        12498              0       Sum of Wgt.      59,758

50%        37208                      Mean           53491.56
                        Largest       Std. Dev.      61803.57
75%        74832         745200
90%       120000         745200       Variance       3.82e+09
95%       156800         745200       Skewness       2.988928
99%       360000         769868       Kurtosis           18.4

. local median_household: di %9.0fc = r(p50)

. putexcel B4=("`median_household'")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. sum ratio

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       ratio |     55,276    .3913858    .3626708          0          1

. local ratio: di %4.2f = r(mean)

. putexcel B5=("`ratio'")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. sum uyearbw50 if inlist(uyearbw50, 0, 1)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   uyearbw50 |     41,545    .2682633    .4430608          0          1

. local mean50: di %4.1f = r(mean)*100

. putexcel B7=("`mean50'")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. sum uyearbw60 if inlist(uyearbw60, 0, 1)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   uyearbw60 |     41,545    .1875797    .3903809          0          1

. local mean60: di %4.1f = r(mean)*100

. putexcel B8=("`mean60'")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. * Partnered
. 
. sum year_upearn if yearspartner==1, detail

                         year_upearn
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              34,677
25%            0              0       Sum of Wgt.      34,677

50%        12000                      Mean           23033.67
                        Largest       Std. Dev.      33511.78
75%        35004         441852
90%        60000         483008       Variance       1.12e+09
95%        80004         510400       Skewness       3.895799
99%       140004         574200       Kurtosis       33.54652

. local median_personal: di %9.0fc = r(p50)

. putexcel C3=("`median_personal'")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. sum year_uhearn if yearspartner==1, detail

                         year_uhearn
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%         2212              0       Obs              36,411
25%        24000              0       Sum of Wgt.      36,411

50%        53096                      Mean           68423.61
                        Largest       Std. Dev.      68030.93
75%        93000         745200
90%       139980         745200       Variance       4.63e+09
95%       182000         745200       Skewness       2.669481
99%       362400         769868       Kurtosis       15.25393

. local median_household: di %9.0fc = r(p50)

. putexcel C4=("`median_household'")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. sum ratio if yearspartner==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       ratio |     35,356     .301414    .2971029          0          1

. local ratio: di %4.2f = r(mean)

. putexcel C5=("`ratio'")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. sum uyearbw50 if inlist(uyearbw50, 0, 1) & yearspartner==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   uyearbw50 |     30,049     .235715    .4244519          0          1

. local mean50: di %4.1f = r(mean)*100

. putexcel C7=("`mean50'")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. sum uyearbw60 if inlist(uyearbw60, 0, 1) & yearspartner==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   uyearbw60 |     30,049     .150188    .3572616          0          1

. local mean60: di %4.1f = r(mean)*100

. putexcel C8=("`mean60'")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. * Not Partnered
. 
. sum year_upearn if yearspartner==0, detail

                         year_upearn
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              13,762
25%            0              0       Sum of Wgt.      13,762

50%        10020                      Mean           17017.71
                        Largest       Std. Dev.      25384.86
75%        24468         382800
90%        43596         382800       Variance       6.44e+08
95%        57996         382800       Skewness       5.282636
99%        99996         435600       Kurtosis        60.1423

. local median_personal: di %9.0fc = r(p50)

. putexcel D3=("`median_personal'")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. sum year_uhearn if yearspartner==0, detail

                         year_uhearn
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              14,429
25%          980              0       Sum of Wgt.      14,429

50%        15448                      Mean           24169.65
                        Largest       Std. Dev.      32160.53
75%        34340         429396
90%        58288         435600       Variance       1.03e+09
95%        79884         498600       Skewness       4.464621
99%       133644         724800       Kurtosis       48.41746

. local median_household: di %9.0fc = r(p50)

. putexcel D4=("`median_household'")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. sum ratio if yearspartner==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       ratio |     11,860    .6700222    .4015485          0          1

. local ratio: di %4.2f = r(mean)

. putexcel D5=("`ratio'")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. sum uyearbw50 if inlist(uyearbw50, 0, 1) & yearspartner==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   uyearbw50 |      5,705    .4503067    .4975681          0          1

. local mean50: di %4.1f = r(mean)*100

. putexcel D7=("`mean50'")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. sum uyearbw60 if inlist(uyearbw60, 0, 1) & yearspartner==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   uyearbw60 |      5,705    .3970202    .4893231          0          1

. local mean60: di %4.1f = r(mean)*100

. putexcel D8=("`mean60'")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. *******************************************************************************
. * calculate cumulative risk of breadwinning 
. *******************************************************************************
. 
. putexcel set "$results/LifetimeBreadwin.xlsx", sheet(Table 3) modify

. putexcel A1="Table 3. Estimates of Breadwinning in first 18 years of Motherhood"
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel B2=("All years") F2=("Year 4 to 5")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel B3=("50%") D3=("60%") F3=("50%") H3=("60%") J3=("n")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A4=("Total")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A5=("Race-Ethnicity")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A6=(" Non-Hispanic White")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A7=(" Black")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A8=(" Non-Black Hispanic")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A9=(" Asian")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A10=(" Other")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A12=("Educational Attainment")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A13=(" Less than High School")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A14=(" High School")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A15=(" Some College")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A16=(" College Grad")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A18=("Partnered")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A19=(" Not Partnered")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A20=(" Partnered")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A21=("Age at first birth")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A22=(" < 18")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A23=(" 19-22")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A24=(" 23-29")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A25=(" 30+")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. keep if durmom < 18 
(17,148 observations deleted)

. 
. *In any given year -- that is, in the cross-section -- the percentage breadwinning is higher with the actual reports and with allocated data and reports.
. *But they are less likely to transition into breadwinning with unallocated data. This suggests that the data allocations are introducing random error and
. *creating artificial instability. We should limit the analysis to measuring using only unallocated data.
. 
. tab durmom ubecbw50 if inlist(ubecbw50,0,1), nofreq row 

           |       ubecbw50
    durmom |         0          1 |     Total
-----------+----------------------+----------
         0 |     96.23       3.77 |    100.00 
         1 |     95.26       4.74 |    100.00 
         2 |     95.31       4.69 |    100.00 
         3 |     96.18       3.82 |    100.00 
         4 |     96.46       3.54 |    100.00 
         5 |     96.07       3.93 |    100.00 
         6 |     95.23       4.77 |    100.00 
         7 |     96.30       3.70 |    100.00 
         8 |     95.95       4.05 |    100.00 
         9 |     96.11       3.89 |    100.00 
        10 |     97.35       2.65 |    100.00 
        11 |     96.51       3.49 |    100.00 
        12 |     96.42       3.58 |    100.00 
        13 |     96.34       3.66 |    100.00 
        14 |     97.01       2.99 |    100.00 
        15 |     95.59       4.41 |    100.00 
        16 |     95.54       4.46 |    100.00 
        17 |     96.11       3.89 |    100.00 
-----------+----------------------+----------
     Total |     96.11       3.89 |    100.00 

. tab durmom ubecbw60 if inlist(ubecbw50,0,1), nofreq row 

           |       ubecbw60
    durmom |         0          1 |     Total
-----------+----------------------+----------
         0 |     97.79       2.21 |    100.00 
         1 |     97.55       2.45 |    100.00 
         2 |     97.20       2.80 |    100.00 
         3 |     97.55       2.45 |    100.00 
         4 |     97.80       2.20 |    100.00 
         5 |     97.78       2.22 |    100.00 
         6 |     97.08       2.92 |    100.00 
         7 |     98.19       1.81 |    100.00 
         8 |     97.69       2.31 |    100.00 
         9 |     97.82       2.18 |    100.00 
        10 |     98.48       1.52 |    100.00 
        11 |     97.76       2.24 |    100.00 
        12 |     98.21       1.79 |    100.00 
        13 |     97.83       2.17 |    100.00 
        14 |     98.58       1.42 |    100.00 
        15 |     97.31       2.69 |    100.00 
        16 |     97.34       2.66 |    100.00 
        17 |     97.81       2.19 |    100.00 
-----------+----------------------+----------
     Total |     97.77       2.23 |    100.00 

. 
. *Create dummy indicators for whether woman entered breadwinning between year when oldest child
. * is aged a and aged a+1. Note that by limiting analysis to `var' = 0 or 1 (ie. !=2), we are in essence
. * dropping cases that were breadwinning in year 1.
. * We haven't yet dropped cases that were ever previously observed breadwinning.
. * That would probably be best calculated back where we create ybecome_bw50 in create_yearearn.do
. 
. preserve

. 
. local transition "ubecbw50 ubecbw60"

. 
. gen ubw50atbir=uyearbw50 if durmom==0
(40,628 missing values generated)

. gen ubw60atbir=uyearbw60 if durmom==0
(40,628 missing values generated)

.         
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 quietly egen `var'`a'=mean(`var') if durmom==`a' & `var' !=2
  4.                 tab `var'`a'
  5.         }
  6. }

  ubecbw500 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0377493 |      1,773      100.00      100.00
------------+-----------------------------------
      Total |      1,773      100.00

  ubecbw501 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0473744 |      2,288      100.00      100.00
------------+-----------------------------------
      Total |      2,288      100.00

  ubecbw502 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0468986 |      1,753      100.00      100.00
------------+-----------------------------------
      Total |      1,753      100.00

  ubecbw503 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0382263 |      1,658      100.00      100.00
------------+-----------------------------------
      Total |      1,658      100.00

  ubecbw504 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0354359 |      1,618      100.00      100.00
------------+-----------------------------------
      Total |      1,618      100.00

  ubecbw505 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0393138 |      1,736      100.00      100.00
------------+-----------------------------------
      Total |      1,736      100.00

  ubecbw506 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0476529 |      1,772      100.00      100.00
------------+-----------------------------------
      Total |      1,772      100.00

  ubecbw507 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0369833 |      1,771      100.00      100.00
------------+-----------------------------------
      Total |      1,771      100.00

  ubecbw508 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0404917 |      1,771      100.00      100.00
------------+-----------------------------------
      Total |      1,771      100.00

  ubecbw509 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0389078 |      1,831      100.00      100.00
------------+-----------------------------------
      Total |      1,831      100.00

 ubecbw5010 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .026455 |      1,880      100.00      100.00
------------+-----------------------------------
      Total |      1,880      100.00

 ubecbw5011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0349144 |      1,930      100.00      100.00
------------+-----------------------------------
      Total |      1,930      100.00

 ubecbw5012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0357853 |      1,901      100.00      100.00
------------+-----------------------------------
      Total |      1,901      100.00

 ubecbw5013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0365606 |      1,904      100.00      100.00
------------+-----------------------------------
      Total |      1,904      100.00

 ubecbw5014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0298507 |      1,876      100.00      100.00
------------+-----------------------------------
      Total |      1,876      100.00

 ubecbw5015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0441075 |      1,861      100.00      100.00
------------+-----------------------------------
      Total |      1,861      100.00

 ubecbw5016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0446369 |      1,866      100.00      100.00
------------+-----------------------------------
      Total |      1,866      100.00

 ubecbw5017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0389344 |      1,871      100.00      100.00
------------+-----------------------------------
      Total |      1,871      100.00

  ubecbw600 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0267738 |      1,863      100.00      100.00
------------+-----------------------------------
      Total |      1,863      100.00

  ubecbw601 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0298742 |      2,444      100.00      100.00
------------+-----------------------------------
      Total |      2,444      100.00

  ubecbw602 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0373388 |      1,904      100.00      100.00
------------+-----------------------------------
      Total |      1,904      100.00

  ubecbw603 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0295736 |      1,804      100.00      100.00
------------+-----------------------------------
      Total |      1,804      100.00

  ubecbw604 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0320308 |      1,768      100.00      100.00
------------+-----------------------------------
      Total |      1,768      100.00

  ubecbw605 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0317769 |      1,879      100.00      100.00
------------+-----------------------------------
      Total |      1,879      100.00

  ubecbw606 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0385621 |      1,896      100.00      100.00
------------+-----------------------------------
      Total |      1,896      100.00

  ubecbw607 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0305851 |      1,896      100.00      100.00
------------+-----------------------------------
      Total |      1,896      100.00

  ubecbw608 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0284204 |      1,901      100.00      100.00
------------+-----------------------------------
      Total |      1,901      100.00

  ubecbw609 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0314233 |      1,989      100.00      100.00
------------+-----------------------------------
      Total |      1,989      100.00

 ubecbw6010 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .025641 |      2,045      100.00      100.00
------------+-----------------------------------
      Total |      2,045      100.00

 ubecbw6011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0320242 |      2,067      100.00      100.00
------------+-----------------------------------
      Total |      2,067      100.00

 ubecbw6012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0226855 |      2,023      100.00      100.00
------------+-----------------------------------
      Total |      2,023      100.00

 ubecbw6013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0284477 |      2,044      100.00      100.00
------------+-----------------------------------
      Total |      2,044      100.00

 ubecbw6014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0295749 |      2,025      100.00      100.00
------------+-----------------------------------
      Total |      2,025      100.00

 ubecbw6015 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .036783 |      2,014      100.00      100.00
------------+-----------------------------------
      Total |      2,014      100.00

 ubecbw6016 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .035585 |      2,023      100.00      100.00
------------+-----------------------------------
      Total |      2,023      100.00

 ubecbw6017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0332512 |      2,031      100.00      100.00
------------+-----------------------------------
      Total |      2,031      100.00

. 
. collapse (max) ubecbw50* ubecbw60* (mean) ubw50atbir ubw60atbir

. 
. gen eubecbw50=1-ubw50atbir

. gen eubecbw60=1-ubw60atbir  

. 
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 replace e`var'=(e`var')*(1-`var'`a')
  4.         }
  5.         tab e`var'
  6. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw50 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .1871685 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw60 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .2429584 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. local bw50=eubecbw50

. local bw60=eubecbw60

. 
. putexcel B4=(1-`bw50') D4=(1-`bw60')
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. restore

. preserve

. 
. keep if my_race==1
(16,128 observations deleted)

. 
. local transition "ubecbw50 ubecbw60"

. 
. gen ubw50atbir=uyearbw50 if durmom==0
(25,282 missing values generated)

. gen ubw60atbir=uyearbw60 if durmom==0
(25,282 missing values generated)

.         
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 quietly egen `var'`a'=mean(`var') if durmom==`a' & `var' !=2
  4.                 tab `var'`a'
  5.         }
  6. }

  ubecbw500 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0410133 |      1,059      100.00      100.00
------------+-----------------------------------
      Total |      1,059      100.00

  ubecbw501 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0500982 |      1,340      100.00      100.00
------------+-----------------------------------
      Total |      1,340      100.00

  ubecbw502 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0545455 |      1,028      100.00      100.00
------------+-----------------------------------
      Total |      1,028      100.00

  ubecbw503 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0335484 |      1,006      100.00      100.00
------------+-----------------------------------
      Total |      1,006      100.00

  ubecbw504 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0353774 |        989      100.00      100.00
------------+-----------------------------------
      Total |        989      100.00

  ubecbw505 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0373832 |      1,060      100.00      100.00
------------+-----------------------------------
      Total |      1,060      100.00

  ubecbw506 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0533333 |      1,135      100.00      100.00
------------+-----------------------------------
      Total |      1,135      100.00

  ubecbw507 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0409556 |      1,122      100.00      100.00
------------+-----------------------------------
      Total |      1,122      100.00

  ubecbw508 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0386417 |      1,108      100.00      100.00
------------+-----------------------------------
      Total |      1,108      100.00

  ubecbw509 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0318681 |      1,133      100.00      100.00
------------+-----------------------------------
      Total |      1,133      100.00

 ubecbw5010 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .029316 |      1,173      100.00      100.00
------------+-----------------------------------
      Total |      1,173      100.00

 ubecbw5011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0369198 |      1,213      100.00      100.00
------------+-----------------------------------
      Total |      1,213      100.00

 ubecbw5012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0351812 |      1,180      100.00      100.00
------------+-----------------------------------
      Total |      1,180      100.00

 ubecbw5013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0314193 |      1,190      100.00      100.00
------------+-----------------------------------
      Total |      1,190      100.00

 ubecbw5014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0323625 |      1,165      100.00      100.00
------------+-----------------------------------
      Total |      1,165      100.00

 ubecbw5015 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .054384 |      1,157      100.00      100.00
------------+-----------------------------------
      Total |      1,157      100.00

 ubecbw5016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0501089 |      1,147      100.00      100.00
------------+-----------------------------------
      Total |      1,147      100.00

 ubecbw5017 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .045204 |      1,151      100.00      100.00
------------+-----------------------------------
      Total |      1,151      100.00

  ubecbw600 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0314607 |      1,120      100.00      100.00
------------+-----------------------------------
      Total |      1,120      100.00

  ubecbw601 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0337778 |      1,447      100.00      100.00
------------+-----------------------------------
      Total |      1,447      100.00

  ubecbw602 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .045403 |      1,139      100.00      100.00
------------+-----------------------------------
      Total |      1,139      100.00

  ubecbw603 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0294451 |      1,114      100.00      100.00
------------+-----------------------------------
      Total |      1,114      100.00

  ubecbw604 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0387435 |      1,096      100.00      100.00
------------+-----------------------------------
      Total |      1,096      100.00

  ubecbw605 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0273684 |      1,154      100.00      100.00
------------+-----------------------------------
      Total |      1,154      100.00

  ubecbw606 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0375635 |      1,220      100.00      100.00
------------+-----------------------------------
      Total |      1,220      100.00

  ubecbw607 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0331263 |      1,209      100.00      100.00
------------+-----------------------------------
      Total |      1,209      100.00

  ubecbw608 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0243644 |      1,198      100.00      100.00
------------+-----------------------------------
      Total |      1,198      100.00

  ubecbw609 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .028348 |      1,246      100.00      100.00
------------+-----------------------------------
      Total |      1,246      100.00

 ubecbw6010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0252427 |      1,282      100.00      100.00
------------+-----------------------------------
      Total |      1,282      100.00

 ubecbw6011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0346154 |      1,305      100.00      100.00
------------+-----------------------------------
      Total |      1,305      100.00

 ubecbw6012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0235988 |      1,259      100.00      100.00
------------+-----------------------------------
      Total |      1,259      100.00

 ubecbw6013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0227273 |      1,279      100.00      100.00
------------+-----------------------------------
      Total |      1,279      100.00

 ubecbw6014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0311891 |      1,264      100.00      100.00
------------+-----------------------------------
      Total |      1,264      100.00

 ubecbw6015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0388834 |      1,259      100.00      100.00
------------+-----------------------------------
      Total |      1,259      100.00

 ubecbw6016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0398445 |      1,258      100.00      100.00
------------+-----------------------------------
      Total |      1,258      100.00

 ubecbw6017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0384995 |      1,257      100.00      100.00
------------+-----------------------------------
      Total |      1,257      100.00

. 
. collapse (max) ubecbw50* ubecbw60* (mean) ubw50atbir ubw60atbir

. 
. gen eubecbw50=1-ubw50atbir

. gen eubecbw60=1-ubw60atbir  

. 
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 replace e`var'=(e`var')*(1-`var'`a')
  4.         }
  5.         tab e`var'
  6. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw50 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .1882129 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw60 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .2488431 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. local bw50=eubecbw50

. local bw60=eubecbw60

. 
. putexcel B6=(1-`bw50') D6=(1-`bw60')
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. restore

. preserve

. 
. keep if my_race==2
(36,809 observations deleted)

. 
. local transition "ubecbw50 ubecbw60"

. 
. gen ubw50atbir=uyearbw50 if durmom==0
(5,502 missing values generated)

. gen ubw60atbir=uyearbw60 if durmom==0
(5,502 missing values generated)

.         
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 quietly egen `var'`a'=mean(`var') if durmom==`a' & `var' !=2
  4.                 tab `var'`a'
  5.         }
  6. }

  ubecbw500 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0182648 |        274      100.00      100.00
------------+-----------------------------------
      Total |        274      100.00

  ubecbw501 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0509091 |        354      100.00      100.00
------------+-----------------------------------
      Total |        354      100.00

  ubecbw502 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0425532 |        262      100.00      100.00
------------+-----------------------------------
      Total |        262      100.00

  ubecbw503 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .038674 |        224      100.00      100.00
------------+-----------------------------------
      Total |        224      100.00

  ubecbw504 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0265957 |        211      100.00      100.00
------------+-----------------------------------
      Total |        211      100.00

  ubecbw505 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0376344 |        222      100.00      100.00
------------+-----------------------------------
      Total |        222      100.00

  ubecbw506 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0424242 |        205      100.00      100.00
------------+-----------------------------------
      Total |        205      100.00

  ubecbw507 |      Freq.     Percent        Cum.
------------+-----------------------------------
     .03125 |        214      100.00      100.00
------------+-----------------------------------
      Total |        214      100.00

  ubecbw508 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0391061 |        227      100.00      100.00
------------+-----------------------------------
      Total |        227      100.00

  ubecbw509 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0534759 |        233      100.00      100.00
------------+-----------------------------------
      Total |        233      100.00

 ubecbw5010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0193237 |        239      100.00      100.00
------------+-----------------------------------
      Total |        239      100.00

 ubecbw5011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0154639 |        243      100.00      100.00
------------+-----------------------------------
      Total |        243      100.00

 ubecbw5012 |      Freq.     Percent        Cum.
------------+-----------------------------------
        .03 |        257      100.00      100.00
------------+-----------------------------------
      Total |        257      100.00

 ubecbw5013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0209424 |        245      100.00      100.00
------------+-----------------------------------
      Total |        245      100.00

 ubecbw5014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0380435 |        249      100.00      100.00
------------+-----------------------------------
      Total |        249      100.00

 ubecbw5015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0111732 |        228      100.00      100.00
------------+-----------------------------------
      Total |        228      100.00

 ubecbw5016 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .020202 |        257      100.00      100.00
------------+-----------------------------------
      Total |        257      100.00

 ubecbw5017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0348259 |        257      100.00      100.00
------------+-----------------------------------
      Total |        257      100.00

  ubecbw600 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0171674 |        288      100.00      100.00
------------+-----------------------------------
      Total |        288      100.00

  ubecbw601 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0238095 |        373      100.00      100.00
------------+-----------------------------------
      Total |        373      100.00

  ubecbw602 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0294118 |        278      100.00      100.00
------------+-----------------------------------
      Total |        278      100.00

  ubecbw603 |      Freq.     Percent        Cum.
------------+-----------------------------------
     .03125 |        235      100.00      100.00
------------+-----------------------------------
      Total |        235      100.00

  ubecbw604 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0100503 |        222      100.00      100.00
------------+-----------------------------------
      Total |        222      100.00

  ubecbw605 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .040201 |        235      100.00      100.00
------------+-----------------------------------
      Total |        235      100.00

  ubecbw606 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0520231 |        213      100.00      100.00
------------+-----------------------------------
      Total |        213      100.00

  ubecbw607 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0301205 |        220      100.00      100.00
------------+-----------------------------------
      Total |        220      100.00

  ubecbw608 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0265957 |        236      100.00      100.00
------------+-----------------------------------
      Total |        236      100.00

  ubecbw609 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0507614 |        243      100.00      100.00
------------+-----------------------------------
      Total |        243      100.00

 ubecbw6010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0225225 |        254      100.00      100.00
------------+-----------------------------------
      Total |        254      100.00

 ubecbw6011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0144928 |        256      100.00      100.00
------------+-----------------------------------
      Total |        256      100.00

 ubecbw6012 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .028169 |        270      100.00      100.00
------------+-----------------------------------
      Total |        270      100.00

 ubecbw6013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0288462 |        262      100.00      100.00
------------+-----------------------------------
      Total |        262      100.00

 ubecbw6014 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .035533 |        262      100.00      100.00
------------+-----------------------------------
      Total |        262      100.00

 ubecbw6015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0307692 |        244      100.00      100.00
------------+-----------------------------------
      Total |        244      100.00

 ubecbw6016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0235849 |        271      100.00      100.00
------------+-----------------------------------
      Total |        271      100.00

 ubecbw6017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0230415 |        273      100.00      100.00
------------+-----------------------------------
      Total |        273      100.00

. 
. collapse (max) ubecbw50* ubecbw60* (mean) ubw50atbir ubw60atbir

. 
. gen eubecbw50=1-ubw50atbir

. gen eubecbw60=1-ubw60atbir  

. 
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 replace e`var'=(e`var')*(1-`var'`a')
  4.         }
  5.         tab e`var'
  6. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw50 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0710527 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw60 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .1026694 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. local bw50=eubecbw50

. local bw60=eubecbw60

. 
. putexcel B7=(1-`bw50') D7=(1-`bw60')
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. restore

. preserve

. 
. keep if my_race==3
(35,817 observations deleted)

. 
. local transition "ubecbw50 ubecbw60"

. 
. gen ubw50atbir=uyearbw50 if durmom==0
(6,488 missing values generated)

. gen ubw60atbir=uyearbw60 if durmom==0
(6,488 missing values generated)

.         
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 quietly egen `var'`a'=mean(`var') if durmom==`a' & `var' !=2
  4.                 tab `var'`a'
  5.         }
  6. }

  ubecbw500 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0350877 |        282      100.00      100.00
------------+-----------------------------------
      Total |        282      100.00

  ubecbw501 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0398671 |        378      100.00      100.00
------------+-----------------------------------
      Total |        378      100.00

  ubecbw502 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0322581 |        302      100.00      100.00
------------+-----------------------------------
      Total |        302      100.00

  ubecbw503 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0508475 |        287      100.00      100.00
------------+-----------------------------------
      Total |        287      100.00

  ubecbw504 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0393701 |        280      100.00      100.00
------------+-----------------------------------
      Total |        280      100.00

  ubecbw505 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0534979 |        301      100.00      100.00
------------+-----------------------------------
      Total |        301      100.00

  ubecbw506 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0366972 |        278      100.00      100.00
------------+-----------------------------------
      Total |        278      100.00

  ubecbw507 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0321101 |        274      100.00      100.00
------------+-----------------------------------
      Total |        274      100.00

  ubecbw508 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0567686 |        287      100.00      100.00
------------+-----------------------------------
      Total |        287      100.00

  ubecbw509 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0524194 |        309      100.00      100.00
------------+-----------------------------------
      Total |        309      100.00

 ubecbw5010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0228137 |        317      100.00      100.00
------------+-----------------------------------
      Total |        317      100.00

 ubecbw5011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0426357 |        320      100.00      100.00
------------+-----------------------------------
      Total |        320      100.00

 ubecbw5012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0423077 |        324      100.00      100.00
------------+-----------------------------------
      Total |        324      100.00

 ubecbw5013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0524194 |        325      100.00      100.00
------------+-----------------------------------
      Total |        325      100.00

 ubecbw5014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0202429 |        317      100.00      100.00
------------+-----------------------------------
      Total |        317      100.00

 ubecbw5015 |      Freq.     Percent        Cum.
------------+-----------------------------------
       .032 |        319      100.00      100.00
------------+-----------------------------------
      Total |        319      100.00

 ubecbw5016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0514706 |        325      100.00      100.00
------------+-----------------------------------
      Total |        325      100.00

 ubecbw5017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0248963 |        318      100.00      100.00
------------+-----------------------------------
      Total |        318      100.00

  ubecbw600 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0215517 |        286      100.00      100.00
------------+-----------------------------------
      Total |        286      100.00

  ubecbw601 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0194175 |        386      100.00      100.00
------------+-----------------------------------
      Total |        386      100.00

  ubecbw602 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0153846 |        314      100.00      100.00
------------+-----------------------------------
      Total |        314      100.00

  ubecbw603 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0321285 |        300      100.00      100.00
------------+-----------------------------------
      Total |        300      100.00

  ubecbw604 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .032967 |        299      100.00      100.00
------------+-----------------------------------
      Total |        299      100.00

  ubecbw605 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0456274 |        321      100.00      100.00
------------+-----------------------------------
      Total |        321      100.00

  ubecbw606 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0381356 |        296      100.00      100.00
------------+-----------------------------------
      Total |        296      100.00

  ubecbw607 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0212766 |        291      100.00      100.00
------------+-----------------------------------
      Total |        291      100.00

  ubecbw608 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0487805 |        304      100.00      100.00
------------+-----------------------------------
      Total |        304      100.00

  ubecbw609 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0333333 |        331      100.00      100.00
------------+-----------------------------------
      Total |        331      100.00

 ubecbw6010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0243056 |        342      100.00      100.00
------------+-----------------------------------
      Total |        342      100.00

 ubecbw6011 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .035461 |        344      100.00      100.00
------------+-----------------------------------
      Total |        344      100.00

 ubecbw6012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0177305 |        346      100.00      100.00
------------+-----------------------------------
      Total |        346      100.00

 ubecbw6013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0407407 |        347      100.00      100.00
------------+-----------------------------------
      Total |        347      100.00

 ubecbw6014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0259259 |        340      100.00      100.00
------------+-----------------------------------
      Total |        340      100.00

 ubecbw6015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0258303 |        340      100.00      100.00
------------+-----------------------------------
      Total |        340      100.00

 ubecbw6016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0340136 |        347      100.00      100.00
------------+-----------------------------------
      Total |        347      100.00

 ubecbw6017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0261194 |        345      100.00      100.00
------------+-----------------------------------
      Total |        345      100.00

. 
. collapse (max) ubecbw50* ubecbw60* (mean) ubw50atbir ubw60atbir

. 
. gen eubecbw50=1-ubw50atbir

. gen eubecbw60=1-ubw60atbir  

. 
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 replace e`var'=(e`var')*(1-`var'`a')
  4.         }
  5.         tab e`var'
  6. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw50 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .2377305 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw60 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .3014378 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. local bw50=eubecbw50

. local bw60=eubecbw60

. 
. putexcel B8=(1-`bw50') D8=(1-`bw60')
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. restore

. preserve

. 
. keep if my_race==4
(40,436 observations deleted)

. 
. local transition "ubecbw50 ubecbw60"

. 
. gen ubw50atbir=uyearbw50 if durmom==0
(2,079 missing values generated)

. gen ubw60atbir=uyearbw60 if durmom==0
(2,079 missing values generated)

.         
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 quietly egen `var'`a'=mean(`var') if durmom==`a' & `var' !=2
  4.                 tab `var'`a'
  5.         }
  6. }

  ubecbw500 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .031746 |         81      100.00      100.00
------------+-----------------------------------
      Total |         81      100.00

  ubecbw501 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .025974 |        110      100.00      100.00
------------+-----------------------------------
      Total |        110      100.00

  ubecbw502 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0273973 |         93      100.00      100.00
------------+-----------------------------------
      Total |         93      100.00

  ubecbw503 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0135135 |         87      100.00      100.00
------------+-----------------------------------
      Total |         87      100.00

  ubecbw504 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0493827 |         93      100.00      100.00
------------+-----------------------------------
      Total |         93      100.00

  ubecbw505 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0135135 |         97      100.00      100.00
------------+-----------------------------------
      Total |         97      100.00

  ubecbw506 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0481928 |        103      100.00      100.00
------------+-----------------------------------
      Total |        103      100.00

  ubecbw507 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0136986 |        100      100.00      100.00
------------+-----------------------------------
      Total |        100      100.00

  ubecbw508 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0135135 |         95      100.00      100.00
------------+-----------------------------------
      Total |         95      100.00

  ubecbw509 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0735294 |         93      100.00      100.00
------------+-----------------------------------
      Total |         93      100.00

 ubecbw5010 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         87      100.00      100.00
------------+-----------------------------------
      Total |         87      100.00

 ubecbw5011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0555556 |         92      100.00      100.00
------------+-----------------------------------
      Total |         92      100.00

 ubecbw5012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0405405 |         94      100.00      100.00
------------+-----------------------------------
      Total |         94      100.00

 ubecbw5013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0810811 |         88      100.00      100.00
------------+-----------------------------------
      Total |         88      100.00

 ubecbw5014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0138889 |         90      100.00      100.00
------------+-----------------------------------
      Total |         90      100.00

 ubecbw5015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0675676 |        100      100.00      100.00
------------+-----------------------------------
      Total |        100      100.00

 ubecbw5016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0441176 |         87      100.00      100.00
------------+-----------------------------------
      Total |         87      100.00

 ubecbw5017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0298507 |         81      100.00      100.00
------------+-----------------------------------
      Total |         81      100.00

  ubecbw600 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0289855 |         87      100.00      100.00
------------+-----------------------------------
      Total |         87      100.00

  ubecbw601 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0224719 |        122      100.00      100.00
------------+-----------------------------------
      Total |        122      100.00

  ubecbw602 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0246914 |        101      100.00      100.00
------------+-----------------------------------
      Total |        101      100.00

  ubecbw603 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         99      100.00      100.00
------------+-----------------------------------
      Total |         99      100.00

  ubecbw604 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0111111 |        102      100.00      100.00
------------+-----------------------------------
      Total |        102      100.00

  ubecbw605 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0232558 |        109      100.00      100.00
------------+-----------------------------------
      Total |        109      100.00

  ubecbw606 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0215054 |        113      100.00      100.00
------------+-----------------------------------
      Total |        113      100.00

  ubecbw607 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0117647 |        112      100.00      100.00
------------+-----------------------------------
      Total |        112      100.00

  ubecbw608 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0117647 |        106      100.00      100.00
------------+-----------------------------------
      Total |        106      100.00

  ubecbw609 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0379747 |        104      100.00      100.00
------------+-----------------------------------
      Total |        104      100.00

 ubecbw6010 |      Freq.     Percent        Cum.
------------+-----------------------------------
       .025 |         99      100.00      100.00
------------+-----------------------------------
      Total |         99      100.00

 ubecbw6011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0384615 |         98      100.00      100.00
------------+-----------------------------------
      Total |         98      100.00

 ubecbw6012 |      Freq.     Percent        Cum.
------------+-----------------------------------
      .0125 |        100      100.00      100.00
------------+-----------------------------------
      Total |        100      100.00

 ubecbw6013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0493827 |         95      100.00      100.00
------------+-----------------------------------
      Total |         95      100.00

 ubecbw6014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0128205 |         96      100.00      100.00
------------+-----------------------------------
      Total |         96      100.00

 ubecbw6015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0632911 |        105      100.00      100.00
------------+-----------------------------------
      Total |        105      100.00

 ubecbw6016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0416667 |         91      100.00      100.00
------------+-----------------------------------
      Total |         91      100.00

 ubecbw6017 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .027027 |         88      100.00      100.00
------------+-----------------------------------
      Total |         88      100.00

. 
. collapse (max) ubecbw50* ubecbw60* (mean) ubw50atbir ubw60atbir

. 
. gen eubecbw50=1-ubw50atbir

. gen eubecbw60=1-ubw60atbir  

. 
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 replace e`var'=(e`var')*(1-`var'`a')
  4.         }
  5.         tab e`var'
  6. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw50 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .2883922 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw60 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .380827 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. local bw50=eubecbw50

. local bw60=eubecbw60

. 
. putexcel B9=(1-`bw50') D9=(1-`bw60')
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. restore

. preserve

. 
. keep if my_race==5
(41,250 observations deleted)

. 
. local transition "ubecbw50 ubecbw60"

. 
. gen ubw50atbir=uyearbw50 if durmom==0
(1,277 missing values generated)

. gen ubw60atbir=uyearbw60 if durmom==0
(1,277 missing values generated)

.         
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 quietly egen `var'`a'=mean(`var') if durmom==`a' & `var' !=2
  4.                 tab `var'`a'
  5.         }
  6. }

  ubecbw500 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0769231 |         77      100.00      100.00
------------+-----------------------------------
      Total |         77      100.00

  ubecbw501 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0493827 |        106      100.00      100.00
------------+-----------------------------------
      Total |        106      100.00

  ubecbw502 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0465116 |         68      100.00      100.00
------------+-----------------------------------
      Total |         68      100.00

  ubecbw503 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0952381 |         54      100.00      100.00
------------+-----------------------------------
      Total |         54      100.00

  ubecbw504 |      Freq.     Percent        Cum.
------------+-----------------------------------
       .025 |         45      100.00      100.00
------------+-----------------------------------
      Total |         45      100.00

  ubecbw505 |      Freq.     Percent        Cum.
------------+-----------------------------------
        .05 |         56      100.00      100.00
------------+-----------------------------------
      Total |         56      100.00

  ubecbw506 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         51      100.00      100.00
------------+-----------------------------------
      Total |         51      100.00

  ubecbw507 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0408163 |         61      100.00      100.00
------------+-----------------------------------
      Total |         61      100.00

  ubecbw508 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0425532 |         54      100.00      100.00
------------+-----------------------------------
      Total |         54      100.00

  ubecbw509 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         63      100.00      100.00
------------+-----------------------------------
      Total |         63      100.00

 ubecbw5010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0566038 |         64      100.00      100.00
------------+-----------------------------------
      Total |         64      100.00

 ubecbw5011 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         62      100.00      100.00
------------+-----------------------------------
      Total |         62      100.00

 ubecbw5012 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .027027 |         46      100.00      100.00
------------+-----------------------------------
      Total |         46      100.00

 ubecbw5013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0487805 |         56      100.00      100.00
------------+-----------------------------------
      Total |         56      100.00

 ubecbw5014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0227273 |         55      100.00      100.00
------------+-----------------------------------
      Total |         55      100.00

 ubecbw5015 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         57      100.00      100.00
------------+-----------------------------------
      Total |         57      100.00

 ubecbw5016 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         50      100.00      100.00
------------+-----------------------------------
      Total |         50      100.00

 ubecbw5017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0208333 |         64      100.00      100.00
------------+-----------------------------------
      Total |         64      100.00

  ubecbw600 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0142857 |         82      100.00      100.00
------------+-----------------------------------
      Total |         82      100.00

  ubecbw601 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .043956 |        116      100.00      100.00
------------+-----------------------------------
      Total |        116      100.00

  ubecbw602 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0638298 |         72      100.00      100.00
------------+-----------------------------------
      Total |         72      100.00

  ubecbw603 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0681818 |         56      100.00      100.00
------------+-----------------------------------
      Total |         56      100.00

  ubecbw604 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0227273 |         49      100.00      100.00
------------+-----------------------------------
      Total |         49      100.00

  ubecbw605 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0227273 |         60      100.00      100.00
------------+-----------------------------------
      Total |         60      100.00

  ubecbw606 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0465116 |         54      100.00      100.00
------------+-----------------------------------
      Total |         54      100.00

  ubecbw607 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0576923 |         64      100.00      100.00
------------+-----------------------------------
      Total |         64      100.00

  ubecbw608 |      Freq.     Percent        Cum.
------------+-----------------------------------
        .04 |         57      100.00      100.00
------------+-----------------------------------
      Total |         57      100.00

  ubecbw609 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         65      100.00      100.00
------------+-----------------------------------
      Total |         65      100.00

 ubecbw6010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0526316 |         68      100.00      100.00
------------+-----------------------------------
      Total |         68      100.00

 ubecbw6011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0208333 |         64      100.00      100.00
------------+-----------------------------------
      Total |         64      100.00

 ubecbw6012 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .025641 |         48      100.00      100.00
------------+-----------------------------------
      Total |         48      100.00

 ubecbw6013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0434783 |         61      100.00      100.00
------------+-----------------------------------
      Total |         61      100.00

 ubecbw6014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0192308 |         63      100.00      100.00
------------+-----------------------------------
      Total |         63      100.00

 ubecbw6015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0357143 |         66      100.00      100.00
------------+-----------------------------------
      Total |         66      100.00

 ubecbw6016 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         56      100.00      100.00
------------+-----------------------------------
      Total |         56      100.00

 ubecbw6017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0192308 |         68      100.00      100.00
------------+-----------------------------------
      Total |         68      100.00

. 
. collapse (max) ubecbw50* ubecbw60* (mean) ubw50atbir ubw60atbir

. 
. gen eubecbw50=1-ubw50atbir

. gen eubecbw60=1-ubw60atbir  

. 
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 replace e`var'=(e`var')*(1-`var'`a')
  4.         }
  5.         tab e`var'
  6. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)

  eubecbw50 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .2527973 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)

  eubecbw60 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .2682628 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. local bw50=eubecbw50

. local bw60=eubecbw60

. 
. putexcel B10=(1-`bw50') D10=(1-`bw60')
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. restore

. preserve

. 
. keep if hieduc==1
(39,803 observations deleted)

. 
. local transition "ubecbw50 ubecbw60"

. 
. gen ubw50atbir=uyearbw50 if durmom==0
(2,771 missing values generated)

. gen ubw60atbir=uyearbw60 if durmom==0
(2,771 missing values generated)

.         
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 quietly egen `var'`a'=mean(`var') if durmom==`a' & `var' !=2
  4.                 tab `var'`a'
  5.         }
  6. }

  ubecbw500 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .037037 |         29      100.00      100.00
------------+-----------------------------------
      Total |         29      100.00

  ubecbw501 |      Freq.     Percent        Cum.
------------+-----------------------------------
        .05 |         64      100.00      100.00
------------+-----------------------------------
      Total |         64      100.00

  ubecbw502 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0117647 |         90      100.00      100.00
------------+-----------------------------------
      Total |         90      100.00

  ubecbw503 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0113636 |         95      100.00      100.00
------------+-----------------------------------
      Total |         95      100.00

  ubecbw504 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0168067 |        124      100.00      100.00
------------+-----------------------------------
      Total |        124      100.00

  ubecbw505 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .016129 |        143      100.00      100.00
------------+-----------------------------------
      Total |        143      100.00

  ubecbw506 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0088496 |        135      100.00      100.00
------------+-----------------------------------
      Total |        135      100.00

  ubecbw507 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0163934 |        139      100.00      100.00
------------+-----------------------------------
      Total |        139      100.00

  ubecbw508 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0390625 |        161      100.00      100.00
------------+-----------------------------------
      Total |        161      100.00

  ubecbw509 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0218978 |        163      100.00      100.00
------------+-----------------------------------
      Total |        163      100.00

 ubecbw5010 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        174      100.00      100.00
------------+-----------------------------------
      Total |        174      100.00

 ubecbw5011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0192308 |        180      100.00      100.00
------------+-----------------------------------
      Total |        180      100.00

 ubecbw5012 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .028169 |        176      100.00      100.00
------------+-----------------------------------
      Total |        176      100.00

 ubecbw5013 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .030303 |        170      100.00      100.00
------------+-----------------------------------
      Total |        170      100.00

 ubecbw5014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0218978 |        170      100.00      100.00
------------+-----------------------------------
      Total |        170      100.00

 ubecbw5015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0243902 |        161      100.00      100.00
------------+-----------------------------------
      Total |        161      100.00

 ubecbw5016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0542636 |        156      100.00      100.00
------------+-----------------------------------
      Total |        156      100.00

 ubecbw5017 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .025641 |        150      100.00      100.00
------------+-----------------------------------
      Total |        150      100.00

  ubecbw600 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0344828 |         31      100.00      100.00
------------+-----------------------------------
      Total |         31      100.00

  ubecbw601 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         66      100.00      100.00
------------+-----------------------------------
      Total |         66      100.00

  ubecbw602 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         95      100.00      100.00
------------+-----------------------------------
      Total |         95      100.00

  ubecbw603 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0106383 |        101      100.00      100.00
------------+-----------------------------------
      Total |        101      100.00

  ubecbw604 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        129      100.00      100.00
------------+-----------------------------------
      Total |        129      100.00

  ubecbw605 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0230769 |        149      100.00      100.00
------------+-----------------------------------
      Total |        149      100.00

  ubecbw606 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        139      100.00      100.00
------------+-----------------------------------
      Total |        139      100.00

  ubecbw607 |      Freq.     Percent        Cum.
------------+-----------------------------------
       .016 |        142      100.00      100.00
------------+-----------------------------------
      Total |        142      100.00

  ubecbw608 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0305344 |        164      100.00      100.00
------------+-----------------------------------
      Total |        164      100.00

  ubecbw609 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .020979 |        169      100.00      100.00
------------+-----------------------------------
      Total |        169      100.00

 ubecbw6010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0064516 |        182      100.00      100.00
------------+-----------------------------------
      Total |        182      100.00

 ubecbw6011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0121212 |        189      100.00      100.00
------------+-----------------------------------
      Total |        189      100.00

 ubecbw6012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0134228 |        183      100.00      100.00
------------+-----------------------------------
      Total |        183      100.00

 ubecbw6013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0285714 |        178      100.00      100.00
------------+-----------------------------------
      Total |        178      100.00

 ubecbw6014 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .013986 |        176      100.00      100.00
------------+-----------------------------------
      Total |        176      100.00

 ubecbw6015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0234375 |        166      100.00      100.00
------------+-----------------------------------
      Total |        166      100.00

 ubecbw6016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0298507 |        161      100.00      100.00
------------+-----------------------------------
      Total |        161      100.00

 ubecbw6017 |      Freq.     Percent        Cum.
------------+-----------------------------------
     .03125 |        161      100.00      100.00
------------+-----------------------------------
      Total |        161      100.00

. 
. collapse (max) ubecbw50* ubecbw60* (mean) ubw50atbir ubw60atbir

. 
. gen eubecbw50=1-ubw50atbir

. gen eubecbw60=1-ubw60atbir  

. 
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 replace e`var'=(e`var')*(1-`var'`a')
  4.         }
  5.         tab e`var'
  6. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw50 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .2682745 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw60 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .3091376 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. local bw50=eubecbw50

. local bw60=eubecbw60

. 
. putexcel B13=(1-`bw50') D13=(1-`bw60')
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. restore

. preserve

. 
. keep if hieduc==2
(33,787 observations deleted)

. 
. local transition "ubecbw50 ubecbw60"

. 
. gen ubw50atbir=uyearbw50 if durmom==0
(8,626 missing values generated)

. gen ubw60atbir=uyearbw60 if durmom==0
(8,626 missing values generated)

.         
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 quietly egen `var'`a'=mean(`var') if durmom==`a' & `var' !=2
  4.                 tab `var'`a'
  5.         }
  6. }

  ubecbw500 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0536913 |        177      100.00      100.00
------------+-----------------------------------
      Total |        177      100.00

  ubecbw501 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0296296 |        319      100.00      100.00
------------+-----------------------------------
      Total |        319      100.00

  ubecbw502 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0433333 |        357      100.00      100.00
------------+-----------------------------------
      Total |        357      100.00

  ubecbw503 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0235294 |        390      100.00      100.00
------------+-----------------------------------
      Total |        390      100.00

  ubecbw504 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0453258 |        392      100.00      100.00
------------+-----------------------------------
      Total |        392      100.00

  ubecbw505 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0447761 |        397      100.00      100.00
------------+-----------------------------------
      Total |        397      100.00

  ubecbw506 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0340557 |        404      100.00      100.00
------------+-----------------------------------
      Total |        404      100.00

  ubecbw507 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0376712 |        381      100.00      100.00
------------+-----------------------------------
      Total |        381      100.00

  ubecbw508 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0539568 |        351      100.00      100.00
------------+-----------------------------------
      Total |        351      100.00

  ubecbw509 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0295082 |        368      100.00      100.00
------------+-----------------------------------
      Total |        368      100.00

 ubecbw5010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0207715 |        414      100.00      100.00
------------+-----------------------------------
      Total |        414      100.00

 ubecbw5011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0245232 |        448      100.00      100.00
------------+-----------------------------------
      Total |        448      100.00

 ubecbw5012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0298103 |        442      100.00      100.00
------------+-----------------------------------
      Total |        442      100.00

 ubecbw5013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0441989 |        461      100.00      100.00
------------+-----------------------------------
      Total |        461      100.00

 ubecbw5014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0139665 |        460      100.00      100.00
------------+-----------------------------------
      Total |        460      100.00

 ubecbw5015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0385675 |        461      100.00      100.00
------------+-----------------------------------
      Total |        461      100.00

 ubecbw5016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0416667 |        468      100.00      100.00
------------+-----------------------------------
      Total |        468      100.00

 ubecbw5017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0384615 |        484      100.00      100.00
------------+-----------------------------------
      Total |        484      100.00

  ubecbw600 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .025974 |        182      100.00      100.00
------------+-----------------------------------
      Total |        182      100.00

  ubecbw601 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0280702 |        334      100.00      100.00
------------+-----------------------------------
      Total |        334      100.00

  ubecbw602 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0348101 |        373      100.00      100.00
------------+-----------------------------------
      Total |        373      100.00

  ubecbw603 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .027933 |        408      100.00      100.00
------------+-----------------------------------
      Total |        408      100.00

  ubecbw604 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0352304 |        408      100.00      100.00
------------+-----------------------------------
      Total |        408      100.00

  ubecbw605 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0306407 |        421      100.00      100.00
------------+-----------------------------------
      Total |        421      100.00

  ubecbw606 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0406977 |        425      100.00      100.00
------------+-----------------------------------
      Total |        425      100.00

  ubecbw607 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0261438 |        395      100.00      100.00
------------+-----------------------------------
      Total |        395      100.00

  ubecbw608 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0266667 |        373      100.00      100.00
------------+-----------------------------------
      Total |        373      100.00

  ubecbw609 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0146199 |        405      100.00      100.00
------------+-----------------------------------
      Total |        405      100.00

 ubecbw6010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0211082 |        456      100.00      100.00
------------+-----------------------------------
      Total |        456      100.00

 ubecbw6011 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .037037 |        486      100.00      100.00
------------+-----------------------------------
      Total |        486      100.00

 ubecbw6012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0153061 |        465      100.00      100.00
------------+-----------------------------------
      Total |        465      100.00

 ubecbw6013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0310881 |        485      100.00      100.00
------------+-----------------------------------
      Total |        485      100.00

 ubecbw6014 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .023622 |        483      100.00      100.00
------------+-----------------------------------
      Total |        483      100.00

 ubecbw6015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0257732 |        486      100.00      100.00
------------+-----------------------------------
      Total |        486      100.00

 ubecbw6016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0251716 |        497      100.00      100.00
------------+-----------------------------------
      Total |        497      100.00

 ubecbw6017 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .027972 |        523      100.00      100.00
------------+-----------------------------------
      Total |        523      100.00

. 
. collapse (max) ubecbw50* ubecbw60* (mean) ubw50atbir ubw60atbir

. 
. gen eubecbw50=1-ubw50atbir

. gen eubecbw60=1-ubw60atbir  

. 
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 replace e`var'=(e`var')*(1-`var'`a')
  4.         }
  5.         tab e`var'
  6. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw50 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .2255174 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw60 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .2817572 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. local bw50=eubecbw50

. local bw60=eubecbw60

. 
. putexcel B14=(1-`bw50') D14=(1-`bw60')
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. restore

. preserve

. 
. keep if hieduc==3
(28,730 observations deleted)

. 
. local transition "ubecbw50 ubecbw60"

. 
. gen ubw50atbir=uyearbw50 if durmom==0
(13,559 missing values generated)

. gen ubw60atbir=uyearbw60 if durmom==0
(13,559 missing values generated)

.         
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 quietly egen `var'`a'=mean(`var') if durmom==`a' & `var' !=2
  4.                 tab `var'`a'
  5.         }
  6. }

  ubecbw500 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0341463 |        262      100.00      100.00
------------+-----------------------------------
      Total |        262      100.00

  ubecbw501 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0726257 |        436      100.00      100.00
------------+-----------------------------------
      Total |        436      100.00

  ubecbw502 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0565553 |        460      100.00      100.00
------------+-----------------------------------
      Total |        460      100.00

  ubecbw503 |      Freq.     Percent        Cum.
------------+-----------------------------------
     .03125 |        496      100.00      100.00
------------+-----------------------------------
      Total |        496      100.00

  ubecbw504 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0264901 |        518      100.00      100.00
------------+-----------------------------------
      Total |        518      100.00

  ubecbw505 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0428266 |        564      100.00      100.00
------------+-----------------------------------
      Total |        564      100.00

  ubecbw506 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0512821 |        588      100.00      100.00
------------+-----------------------------------
      Total |        588      100.00

  ubecbw507 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0443975 |        595      100.00      100.00
------------+-----------------------------------
      Total |        595      100.00

  ubecbw508 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0303644 |        623      100.00      100.00
------------+-----------------------------------
      Total |        623      100.00

  ubecbw509 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0542636 |        635      100.00      100.00
------------+-----------------------------------
      Total |        635      100.00

 ubecbw5010 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .040146 |        670      100.00      100.00
------------+-----------------------------------
      Total |        670      100.00

 ubecbw5011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0426716 |        682      100.00      100.00
------------+-----------------------------------
      Total |        682      100.00

 ubecbw5012 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .037037 |        691      100.00      100.00
------------+-----------------------------------
      Total |        691      100.00

 ubecbw5013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0349265 |        688      100.00      100.00
------------+-----------------------------------
      Total |        688      100.00

 ubecbw5014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0333333 |        684      100.00      100.00
------------+-----------------------------------
      Total |        684      100.00

 ubecbw5015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0390335 |        679      100.00      100.00
------------+-----------------------------------
      Total |        679      100.00

 ubecbw5016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0397112 |        707      100.00      100.00
------------+-----------------------------------
      Total |        707      100.00

 ubecbw5017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0401396 |        718      100.00      100.00
------------+-----------------------------------
      Total |        718      100.00

  ubecbw600 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0179372 |        280      100.00      100.00
------------+-----------------------------------
      Total |        280      100.00

  ubecbw601 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0309278 |        466      100.00      100.00
------------+-----------------------------------
      Total |        466      100.00

  ubecbw602 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0511628 |        501      100.00      100.00
------------+-----------------------------------
      Total |        501      100.00

  ubecbw603 |      Freq.     Percent        Cum.
------------+-----------------------------------
     .01766 |        533      100.00      100.00
------------+-----------------------------------
      Total |        533      100.00

  ubecbw604 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0201207 |        562      100.00      100.00
------------+-----------------------------------
      Total |        562      100.00

  ubecbw605 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0234834 |        608      100.00      100.00
------------+-----------------------------------
      Total |        608      100.00

  ubecbw606 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .037182 |        631      100.00      100.00
------------+-----------------------------------
      Total |        631      100.00

  ubecbw607 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .030888 |        640      100.00      100.00
------------+-----------------------------------
      Total |        640      100.00

  ubecbw608 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0278293 |        668      100.00      100.00
------------+-----------------------------------
      Total |        668      100.00

  ubecbw609 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0394265 |        677      100.00      100.00
------------+-----------------------------------
      Total |        677      100.00

 ubecbw6010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0267112 |        721      100.00      100.00
------------+-----------------------------------
      Total |        721      100.00

 ubecbw6011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0274914 |        725      100.00      100.00
------------+-----------------------------------
      Total |        725      100.00

 ubecbw6012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0252525 |        745      100.00      100.00
------------+-----------------------------------
      Total |        745      100.00

 ubecbw6013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0232172 |        747      100.00      100.00
------------+-----------------------------------
      Total |        747      100.00

 ubecbw6014 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .026534 |        747      100.00      100.00
------------+-----------------------------------
      Total |        747      100.00

 ubecbw6015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0376432 |        752      100.00      100.00
------------+-----------------------------------
      Total |        752      100.00

 ubecbw6016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0416667 |        777      100.00      100.00
------------+-----------------------------------
      Total |        777      100.00

 ubecbw6017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0254372 |        774      100.00      100.00
------------+-----------------------------------
      Total |        774      100.00

. 
. collapse (max) ubecbw50* ubecbw60* (mean) ubw50atbir ubw60atbir

. 
. gen eubecbw50=1-ubw50atbir

. gen eubecbw60=1-ubw60atbir  

. 
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 replace e`var'=(e`var')*(1-`var'`a')
  4.         }
  5.         tab e`var'
  6. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw50 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .1690171 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw60 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .2379947 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. local bw50=eubecbw50

. local bw60=eubecbw60

. 
. putexcel B15=(1-`bw50') D15=(1-`bw60')
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. restore

. preserve

. 
. keep if hieduc==4
(29,246 observations deleted)

. 
. local transition "ubecbw50 ubecbw60"

. 
. gen ubw50atbir=uyearbw50 if durmom==0
(13,048 missing values generated)

. gen ubw60atbir=uyearbw60 if durmom==0
(13,048 missing values generated)

.         
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 quietly egen `var'`a'=mean(`var') if durmom==`a' & `var' !=2
  4.                 tab `var'`a'
  5.         }
  6. }

  ubecbw500 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0461538 |        189      100.00      100.00
------------+-----------------------------------
      Total |        189      100.00

  ubecbw501 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0793651 |        411      100.00      100.00
------------+-----------------------------------
      Total |        411      100.00

  ubecbw502 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0577508 |        420      100.00      100.00
------------+-----------------------------------
      Total |        420      100.00

  ubecbw503 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .056266 |        491      100.00      100.00
------------+-----------------------------------
      Total |        491      100.00

  ubecbw504 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0449438 |        517      100.00      100.00
------------+-----------------------------------
      Total |        517      100.00

  ubecbw505 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0403587 |        593      100.00      100.00
------------+-----------------------------------
      Total |        593      100.00

  ubecbw506 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0618337 |        603      100.00      100.00
------------+-----------------------------------
      Total |        603      100.00

  ubecbw507 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0341151 |        623      100.00      100.00
------------+-----------------------------------
      Total |        623      100.00

  ubecbw508 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0461538 |        604      100.00      100.00
------------+-----------------------------------
      Total |        604      100.00

  ubecbw509 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0278373 |        619      100.00      100.00
------------+-----------------------------------
      Total |        619      100.00

 ubecbw5010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0223214 |        584      100.00      100.00
------------+-----------------------------------
      Total |        584      100.00

 ubecbw5011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0422535 |        582      100.00      100.00
------------+-----------------------------------
      Total |        582      100.00

 ubecbw5012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0418605 |        553      100.00      100.00
------------+-----------------------------------
      Total |        553      100.00

 ubecbw5013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0338983 |        552      100.00      100.00
------------+-----------------------------------
      Total |        552      100.00

 ubecbw5014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0363196 |        532      100.00      100.00
------------+-----------------------------------
      Total |        532      100.00

 ubecbw5015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0634146 |        535      100.00      100.00
------------+-----------------------------------
      Total |        535      100.00

 ubecbw5016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0518135 |        505      100.00      100.00
------------+-----------------------------------
      Total |        505      100.00

 ubecbw5017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0433604 |        500      100.00      100.00
------------+-----------------------------------
      Total |        500      100.00

  ubecbw600 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0352941 |        229      100.00      100.00
------------+-----------------------------------
      Total |        229      100.00

  ubecbw601 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0645995 |        483      100.00      100.00
------------+-----------------------------------
      Total |        483      100.00

  ubecbw602 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .044665 |        494      100.00      100.00
------------+-----------------------------------
      Total |        494      100.00

  ubecbw603 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0424628 |        571      100.00      100.00
------------+-----------------------------------
      Total |        571      100.00

  ubecbw604 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0496183 |        596      100.00      100.00
------------+-----------------------------------
      Total |        596      100.00

  ubecbw605 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0447471 |        661      100.00      100.00
------------+-----------------------------------
      Total |        661      100.00

  ubecbw606 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0438931 |        658      100.00      100.00
------------+-----------------------------------
      Total |        658      100.00

  ubecbw607 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .037594 |        686      100.00      100.00
------------+-----------------------------------
      Total |        686      100.00

  ubecbw608 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .031068 |        664      100.00      100.00
------------+-----------------------------------
      Total |        664      100.00

  ubecbw609 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0315399 |        691      100.00      100.00
------------+-----------------------------------
      Total |        691      100.00

 ubecbw6010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0332681 |        647      100.00      100.00
------------+-----------------------------------
      Total |        647      100.00

 ubecbw6011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0422833 |        629      100.00      100.00
------------+-----------------------------------
      Total |        629      100.00

 ubecbw6012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0277778 |        591      100.00      100.00
------------+-----------------------------------
      Total |        591      100.00

 ubecbw6013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0324675 |        601      100.00      100.00
------------+-----------------------------------
      Total |        601      100.00

 ubecbw6014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0382979 |        589      100.00      100.00
------------+-----------------------------------
      Total |        589      100.00

 ubecbw6015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0501089 |        584      100.00      100.00
------------+-----------------------------------
      Total |        584      100.00

 ubecbw6016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0388128 |        557      100.00      100.00
------------+-----------------------------------
      Total |        557      100.00

 ubecbw6017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0520095 |        554      100.00      100.00
------------+-----------------------------------
      Total |        554      100.00

. 
. collapse (max) ubecbw50* ubecbw60* (mean) ubw50atbir ubw60atbir

. 
. gen eubecbw50=1-ubw50atbir

. gen eubecbw60=1-ubw60atbir  

. 
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 replace e`var'=(e`var')*(1-`var'`a')
  4.         }
  5.         tab e`var'
  6. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw50 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .1444971 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw60 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .2093113 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. local bw50=eubecbw50

. local bw60=eubecbw60

. 
. putexcel B16=(1-`bw50') D16=(1-`bw60')
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. restore

. preserve

. 
. keep if yearspartner==0
(32,554 observations deleted)

. 
. local transition "ubecbw50 ubecbw60"

. 
. gen ubw50atbir=uyearbw50 if durmom==0
(9,670 missing values generated)

. gen ubw60atbir=uyearbw60 if durmom==0
(9,670 missing values generated)

.         
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 quietly egen `var'`a'=mean(`var') if durmom==`a' & `var' !=2
  4.                 tab `var'`a'
  5.         }
  6. }

  ubecbw500 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0344828 |        341      100.00      100.00
------------+-----------------------------------
      Total |        341      100.00

  ubecbw501 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .038674 |        707      100.00      100.00
------------+-----------------------------------
      Total |        707      100.00

  ubecbw502 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0253165 |        525      100.00      100.00
------------+-----------------------------------
      Total |        525      100.00

  ubecbw503 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0379404 |        465      100.00      100.00
------------+-----------------------------------
      Total |        465      100.00

  ubecbw504 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0189189 |        426      100.00      100.00
------------+-----------------------------------
      Total |        426      100.00

  ubecbw505 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0213904 |        454      100.00      100.00
------------+-----------------------------------
      Total |        454      100.00

  ubecbw506 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .028125 |        414      100.00      100.00
------------+-----------------------------------
      Total |        414      100.00

  ubecbw507 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0160772 |        413      100.00      100.00
------------+-----------------------------------
      Total |        413      100.00

  ubecbw508 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0130293 |        398      100.00      100.00
------------+-----------------------------------
      Total |        398      100.00

  ubecbw509 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0197368 |        386      100.00      100.00
------------+-----------------------------------
      Total |        386      100.00

 ubecbw5010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0169972 |        428      100.00      100.00
------------+-----------------------------------
      Total |        428      100.00

 ubecbw5011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0141243 |        434      100.00      100.00
------------+-----------------------------------
      Total |        434      100.00

 ubecbw5012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0189702 |        460      100.00      100.00
------------+-----------------------------------
      Total |        460      100.00

 ubecbw5013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0208333 |        428      100.00      100.00
------------+-----------------------------------
      Total |        428      100.00

 ubecbw5014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0114943 |        443      100.00      100.00
------------+-----------------------------------
      Total |        443      100.00

 ubecbw5015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0028818 |        436      100.00      100.00
------------+-----------------------------------
      Total |        436      100.00

 ubecbw5016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0128866 |        466      100.00      100.00
------------+-----------------------------------
      Total |        466      100.00

 ubecbw5017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0056497 |        453      100.00      100.00
------------+-----------------------------------
      Total |        453      100.00

  ubecbw600 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0111524 |        349      100.00      100.00
------------+-----------------------------------
      Total |        349      100.00

  ubecbw601 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .017762 |        727      100.00      100.00
------------+-----------------------------------
      Total |        727      100.00

  ubecbw602 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0240385 |        546      100.00      100.00
------------+-----------------------------------
      Total |        546      100.00

  ubecbw603 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0257732 |        484      100.00      100.00
------------+-----------------------------------
      Total |        484      100.00

  ubecbw604 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0131234 |        437      100.00      100.00
------------+-----------------------------------
      Total |        437      100.00

  ubecbw605 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0230769 |        470      100.00      100.00
------------+-----------------------------------
      Total |        470      100.00

  ubecbw606 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0338462 |        419      100.00      100.00
------------+-----------------------------------
      Total |        419      100.00

  ubecbw607 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .009434 |        420      100.00      100.00
------------+-----------------------------------
      Total |        420      100.00

  ubecbw608 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0127389 |        405      100.00      100.00
------------+-----------------------------------
      Total |        405      100.00

  ubecbw609 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0192926 |        393      100.00      100.00
------------+-----------------------------------
      Total |        393      100.00

 ubecbw6010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0137363 |        439      100.00      100.00
------------+-----------------------------------
      Total |        439      100.00

 ubecbw6011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0163934 |        446      100.00      100.00
------------+-----------------------------------
      Total |        446      100.00

 ubecbw6012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0185676 |        468      100.00      100.00
------------+-----------------------------------
      Total |        468      100.00

 ubecbw6013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0202312 |        438      100.00      100.00
------------+-----------------------------------
      Total |        438      100.00

 ubecbw6014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0111421 |        454      100.00      100.00
------------+-----------------------------------
      Total |        454      100.00

 ubecbw6015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0083102 |        450      100.00      100.00
------------+-----------------------------------
      Total |        450      100.00

 ubecbw6016 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .007371 |        485      100.00      100.00
------------+-----------------------------------
      Total |        485      100.00

 ubecbw6017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0081967 |        465      100.00      100.00
------------+-----------------------------------
      Total |        465      100.00

. 
. collapse (max) ubecbw50* ubecbw60* (mean) ubw50atbir ubw60atbir

. 
. gen eubecbw50=1-ubw50atbir

. gen eubecbw60=1-ubw60atbir  

. 
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 replace e`var'=(e`var')*(1-`var'`a')
  4.         }
  5.         tab e`var'
  6. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw50 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .2669633 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw60 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .3022014 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. local bw50=eubecbw50

. local bw60=eubecbw60

. 
. putexcel B19=(1-`bw50') D19=(1-`bw60')
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. restore

. preserve

. 
. keep if yearspartner==1
(17,057 observations deleted)

. 
. local transition "ubecbw50 ubecbw60"

. 
. gen ubw50atbir=uyearbw50 if durmom==0
(25,077 missing values generated)

. gen ubw60atbir=uyearbw60 if durmom==0
(25,077 missing values generated)

.         
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 quietly egen `var'`a'=mean(`var') if durmom==`a' & `var' !=2
  4.                 tab `var'`a'
  5.         }
  6. }

  ubecbw500 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .045045 |        329      100.00      100.00
------------+-----------------------------------
      Total |        329      100.00

  ubecbw501 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0516499 |        955      100.00      100.00
------------+-----------------------------------
      Total |        955      100.00

  ubecbw502 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0585586 |        873      100.00      100.00
------------+-----------------------------------
      Total |        873      100.00

  ubecbw503 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0412088 |        930      100.00      100.00
------------+-----------------------------------
      Total |        930      100.00

  ubecbw504 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0412736 |        975      100.00      100.00
------------+-----------------------------------
      Total |        975      100.00

  ubecbw505 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .049763 |      1,047      100.00      100.00
------------+-----------------------------------
      Total |      1,047      100.00

  ubecbw506 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0551802 |      1,114      100.00      100.00
------------+-----------------------------------
      Total |      1,114      100.00

  ubecbw507 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0394588 |      1,126      100.00      100.00
------------+-----------------------------------
      Total |      1,126      100.00

  ubecbw508 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0474041 |      1,138      100.00      100.00
------------+-----------------------------------
      Total |      1,138      100.00

  ubecbw509 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0402477 |      1,207      100.00      100.00
------------+-----------------------------------
      Total |      1,207      100.00

 ubecbw5010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0327533 |      1,224      100.00      100.00
------------+-----------------------------------
      Total |      1,224      100.00

 ubecbw5011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0443996 |      1,275      100.00      100.00
------------+-----------------------------------
      Total |      1,275      100.00

 ubecbw5012 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .040858 |      1,230      100.00      100.00
------------+-----------------------------------
      Total |      1,230      100.00

 ubecbw5013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0404984 |      1,240      100.00      100.00
------------+-----------------------------------
      Total |      1,240      100.00

 ubecbw5014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0355277 |      1,215      100.00      100.00
------------+-----------------------------------
      Total |      1,215      100.00

 ubecbw5015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0577125 |      1,227      100.00      100.00
------------+-----------------------------------
      Total |      1,227      100.00

 ubecbw5016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0545645 |      1,205      100.00      100.00
------------+-----------------------------------
      Total |      1,205      100.00

 ubecbw5017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0523013 |      1,224      100.00      100.00
------------+-----------------------------------
      Total |      1,224      100.00

  ubecbw600 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0373134 |        375      100.00      100.00
------------+-----------------------------------
      Total |        375      100.00

  ubecbw601 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0366162 |      1,050      100.00      100.00
------------+-----------------------------------
      Total |      1,050      100.00

  ubecbw602 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0452196 |        981      100.00      100.00
------------+-----------------------------------
      Total |        981      100.00

  ubecbw603 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0335731 |      1,036      100.00      100.00
------------+-----------------------------------
      Total |      1,036      100.00

  ubecbw604 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0415369 |      1,090      100.00      100.00
------------+-----------------------------------
      Total |      1,090      100.00

  ubecbw605 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0380148 |      1,150      100.00      100.00
------------+-----------------------------------
      Total |      1,150      100.00

  ubecbw606 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0424242 |      1,216      100.00      100.00
------------+-----------------------------------
      Total |      1,216      100.00

  ubecbw607 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0356053 |      1,222      100.00      100.00
------------+-----------------------------------
      Total |      1,222      100.00

  ubecbw608 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0283401 |      1,240      100.00      100.00
------------+-----------------------------------
      Total |      1,240      100.00

  ubecbw609 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .032967 |      1,330      100.00      100.00
------------+-----------------------------------
      Total |      1,330      100.00

 ubecbw6010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0317604 |      1,349      100.00      100.00
------------+-----------------------------------
      Total |      1,349      100.00

 ubecbw6011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0393053 |      1,378      100.00      100.00
------------+-----------------------------------
      Total |      1,378      100.00

 ubecbw6012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0232775 |      1,325      100.00      100.00
------------+-----------------------------------
      Total |      1,325      100.00

 ubecbw6013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0334572 |      1,353      100.00      100.00
------------+-----------------------------------
      Total |      1,353      100.00

 ubecbw6014 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .032833 |      1,324      100.00      100.00
------------+-----------------------------------
      Total |      1,324      100.00

 ubecbw6015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0448179 |      1,345      100.00      100.00
------------+-----------------------------------
      Total |      1,345      100.00

 ubecbw6016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0439252 |      1,322      100.00      100.00
------------+-----------------------------------
      Total |      1,322      100.00

 ubecbw6017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0425926 |      1,348      100.00      100.00
------------+-----------------------------------
      Total |      1,348      100.00

. 
. collapse (max) ubecbw50* ubecbw60* (mean) ubw50atbir ubw60atbir

. 
. gen eubecbw50=1-ubw50atbir

. gen eubecbw60=1-ubw60atbir  

. 
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 replace e`var'=(e`var')*(1-`var'`a')
  4.         }
  5.         tab e`var'
  6. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw50 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .2202952 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw60 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .3097503 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. local bw50=eubecbw50

. local bw60=eubecbw60

. 
. putexcel B20=(1-`bw50') D20=(1-`bw60')
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. restore

. preserve

. 
. keep if agebir1==1
(38,139 observations deleted)

. 
. local transition "ubecbw50 ubecbw60"

. 
. gen ubw50atbir=uyearbw50 if durmom==0
(4,397 missing values generated)

. gen ubw60atbir=uyearbw60 if durmom==0
(4,397 missing values generated)

. 
. tab ubw50atbir

 ubw50atbir |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         62       83.78       83.78
          1 |          1        1.35       85.14
          2 |         11       14.86      100.00
------------+-----------------------------------
      Total |         74      100.00

. tab ubw60atbir

 ubw60atbir |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         62       83.78       83.78
          1 |          1        1.35       85.14
          2 |         11       14.86      100.00
------------+-----------------------------------
      Total |         74      100.00

. 
.         
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 quietly egen `var'`a'=mean(`var') if durmom==`a' & `var' !=2
  4.                 tab `var'`a'
  5.         }
  6. }

  ubecbw500 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0677966 |         73      100.00      100.00
------------+-----------------------------------
      Total |         73      100.00

  ubecbw501 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0283688 |        168      100.00      100.00
------------+-----------------------------------
      Total |        168      100.00

  ubecbw502 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0472973 |        171      100.00      100.00
------------+-----------------------------------
      Total |        171      100.00

  ubecbw503 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0188679 |        176      100.00      100.00
------------+-----------------------------------
      Total |        176      100.00

  ubecbw504 |      Freq.     Percent        Cum.
------------+-----------------------------------
      .0125 |        175      100.00      100.00
------------+-----------------------------------
      Total |        175      100.00

  ubecbw505 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0479042 |        195      100.00      100.00
------------+-----------------------------------
      Total |        195      100.00

  ubecbw506 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .048951 |        177      100.00      100.00
------------+-----------------------------------
      Total |        177      100.00

  ubecbw507 |      Freq.     Percent        Cum.
------------+-----------------------------------
        .06 |        188      100.00      100.00
------------+-----------------------------------
      Total |        188      100.00

  ubecbw508 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .037594 |        166      100.00      100.00
------------+-----------------------------------
      Total |        166      100.00

  ubecbw509 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0318471 |        188      100.00      100.00
------------+-----------------------------------
      Total |        188      100.00

 ubecbw5010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0268817 |        217      100.00      100.00
------------+-----------------------------------
      Total |        217      100.00

 ubecbw5011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0236967 |        244      100.00      100.00
------------+-----------------------------------
      Total |        244      100.00

 ubecbw5012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0232558 |        242      100.00      100.00
------------+-----------------------------------
      Total |        242      100.00

 ubecbw5013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0384615 |        247      100.00      100.00
------------+-----------------------------------
      Total |        247      100.00

 ubecbw5014 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .039801 |        245      100.00      100.00
------------+-----------------------------------
      Total |        245      100.00

 ubecbw5015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0572917 |        256      100.00      100.00
------------+-----------------------------------
      Total |        256      100.00

 ubecbw5016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0536585 |        237      100.00      100.00
------------+-----------------------------------
      Total |        237      100.00

 ubecbw5017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0416667 |        248      100.00      100.00
------------+-----------------------------------
      Total |        248      100.00

  ubecbw600 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0338983 |         73      100.00      100.00
------------+-----------------------------------
      Total |         73      100.00

  ubecbw601 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .020979 |        170      100.00      100.00
------------+-----------------------------------
      Total |        170      100.00

  ubecbw602 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0331126 |        174      100.00      100.00
------------+-----------------------------------
      Total |        174      100.00

  ubecbw603 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0184049 |        180      100.00      100.00
------------+-----------------------------------
      Total |        180      100.00

  ubecbw604 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0060606 |        180      100.00      100.00
------------+-----------------------------------
      Total |        180      100.00

  ubecbw605 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0454545 |        204      100.00      100.00
------------+-----------------------------------
      Total |        204      100.00

  ubecbw606 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0584416 |        188      100.00      100.00
------------+-----------------------------------
      Total |        188      100.00

  ubecbw607 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0193548 |        193      100.00      100.00
------------+-----------------------------------
      Total |        193      100.00

  ubecbw608 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .028169 |        175      100.00      100.00
------------+-----------------------------------
      Total |        175      100.00

  ubecbw609 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0178571 |        199      100.00      100.00
------------+-----------------------------------
      Total |        199      100.00

 ubecbw6010 |      Freq.     Percent        Cum.
------------+-----------------------------------
       .025 |        231      100.00      100.00
------------+-----------------------------------
      Total |        231      100.00

 ubecbw6011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0222222 |        258      100.00      100.00
------------+-----------------------------------
      Total |        258      100.00

 ubecbw6012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0176211 |        254      100.00      100.00
------------+-----------------------------------
      Total |        254      100.00

 ubecbw6013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0266667 |        264      100.00      100.00
------------+-----------------------------------
      Total |        264      100.00

 ubecbw6014 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .027907 |        259      100.00      100.00
------------+-----------------------------------
      Total |        259      100.00

 ubecbw6015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0434783 |        271      100.00      100.00
------------+-----------------------------------
      Total |        271      100.00

 ubecbw6016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0403587 |        255      100.00      100.00
------------+-----------------------------------
      Total |        255      100.00

 ubecbw6017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0380952 |        266      100.00      100.00
------------+-----------------------------------
      Total |        266      100.00

. 
. collapse (max) ubecbw50* ubecbw60* (mean) ubw50atbir ubw60atbir

. 
. gen eubecbw50=1-ubw50atbir

. gen eubecbw60=1-ubw60atbir  

. 
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 replace e`var'=(e`var')*(1-`var'`a')
  4.         }
  5.         tab e`var'
  6. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw50 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .3347243 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw60 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .4047359 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. local bw50=eubecbw50

. local bw60=eubecbw60

. 
. putexcel B22=(1-`bw50') D22=(1-`bw60')
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. restore

. preserve

. 
. keep if agebir1==2
(31,489 observations deleted)

. 
. local transition "ubecbw50 ubecbw60"

. 
. gen ubw50atbir=uyearbw50 if durmom==0
(10,860 missing values generated)

. gen ubw60atbir=uyearbw60 if durmom==0
(10,860 missing values generated)

.         
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 quietly egen `var'`a'=mean(`var') if durmom==`a' & `var' !=2
  4.                 tab `var'`a'
  5.         }
  6. }

  ubecbw500 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .025641 |        239      100.00      100.00
------------+-----------------------------------
      Total |        239      100.00

  ubecbw501 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0582751 |        531      100.00      100.00
------------+-----------------------------------
      Total |        531      100.00

  ubecbw502 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0351351 |        470      100.00      100.00
------------+-----------------------------------
      Total |        470      100.00

  ubecbw503 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0396825 |        452      100.00      100.00
------------+-----------------------------------
      Total |        452      100.00

  ubecbw504 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .030303 |        448      100.00      100.00
------------+-----------------------------------
      Total |        448      100.00

  ubecbw505 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0433673 |        477      100.00      100.00
------------+-----------------------------------
      Total |        477      100.00

  ubecbw506 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0369393 |        466      100.00      100.00
------------+-----------------------------------
      Total |        466      100.00

  ubecbw507 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0385675 |        473      100.00      100.00
------------+-----------------------------------
      Total |        473      100.00

  ubecbw508 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0612245 |        488      100.00      100.00
------------+-----------------------------------
      Total |        488      100.00

  ubecbw509 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0377358 |        508      100.00      100.00
------------+-----------------------------------
      Total |        508      100.00

 ubecbw5010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0281996 |        559      100.00      100.00
------------+-----------------------------------
      Total |        559      100.00

 ubecbw5011 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .043573 |        559      100.00      100.00
------------+-----------------------------------
      Total |        559      100.00

 ubecbw5012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0297483 |        554      100.00      100.00
------------+-----------------------------------
      Total |        554      100.00

 ubecbw5013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0414747 |        561      100.00      100.00
------------+-----------------------------------
      Total |        561      100.00

 ubecbw5014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0342298 |        536      100.00      100.00
------------+-----------------------------------
      Total |        536      100.00

 ubecbw5015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0464548 |        519      100.00      100.00
------------+-----------------------------------
      Total |        519      100.00

 ubecbw5016 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .053528 |        520      100.00      100.00
------------+-----------------------------------
      Total |        520      100.00

 ubecbw5017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0552885 |        528      100.00      100.00
------------+-----------------------------------
      Total |        528      100.00

  ubecbw600 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0049751 |        245      100.00      100.00
------------+-----------------------------------
      Total |        245      100.00

  ubecbw601 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0330396 |        556      100.00      100.00
------------+-----------------------------------
      Total |        556      100.00

  ubecbw602 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0401003 |        499      100.00      100.00
------------+-----------------------------------
      Total |        499      100.00

  ubecbw603 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0294118 |        482      100.00      100.00
------------+-----------------------------------
      Total |        482      100.00

  ubecbw604 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .030303 |        481      100.00      100.00
------------+-----------------------------------
      Total |        481      100.00

  ubecbw605 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0264423 |        501      100.00      100.00
------------+-----------------------------------
      Total |        501      100.00

  ubecbw606 |      Freq.     Percent        Cum.
------------+-----------------------------------
     .02457 |        494      100.00      100.00
------------+-----------------------------------
      Total |        494      100.00

  ubecbw607 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .035533 |        504      100.00      100.00
------------+-----------------------------------
      Total |        504      100.00

  ubecbw608 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0400943 |        520      100.00      100.00
------------+-----------------------------------
      Total |        520      100.00

  ubecbw609 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0301075 |        549      100.00      100.00
------------+-----------------------------------
      Total |        549      100.00

 ubecbw6010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0237154 |        604      100.00      100.00
------------+-----------------------------------
      Total |        604      100.00

 ubecbw6011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0360721 |        599      100.00      100.00
------------+-----------------------------------
      Total |        599      100.00

 ubecbw6012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0214133 |        584      100.00      100.00
------------+-----------------------------------
      Total |        584      100.00

 ubecbw6013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0320513 |        595      100.00      100.00
------------+-----------------------------------
      Total |        595      100.00

 ubecbw6014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0354767 |        578      100.00      100.00
------------+-----------------------------------
      Total |        578      100.00

 ubecbw6015 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .039823 |        562      100.00      100.00
------------+-----------------------------------
      Total |        562      100.00

 ubecbw6016 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .037694 |        560      100.00      100.00
------------+-----------------------------------
      Total |        560      100.00

 ubecbw6017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0409483 |        576      100.00      100.00
------------+-----------------------------------
      Total |        576      100.00

. 
. collapse (max) ubecbw50* ubecbw60* (mean) ubw50atbir ubw60atbir

. 
. gen eubecbw50=1-ubw50atbir

. gen eubecbw60=1-ubw60atbir  

. 
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 replace e`var'=(e`var')*(1-`var'`a')
  4.         }
  5.         tab e`var'
  6. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw50 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .2662529 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw60 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .333203 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. local bw50=eubecbw50

. local bw60=eubecbw60

. 
. putexcel B23=(1-`bw50') D23=(1-`bw60')
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. restore

. preserve

. 
. keep if agebir1==3
(29,011 observations deleted)

. 
. local transition "ubecbw50 ubecbw60"

. 
. gen ubw50atbir=uyearbw50 if durmom==0
(13,288 missing values generated)

. gen ubw60atbir=uyearbw60 if durmom==0
(13,288 missing values generated)

.         
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 quietly egen `var'`a'=mean(`var') if durmom==`a' & `var' !=2
  4.                 tab `var'`a'
  5.         }
  6. }

  ubecbw500 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0608108 |        221      100.00      100.00
------------+-----------------------------------
      Total |        221      100.00

  ubecbw501 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0543478 |        647      100.00      100.00
------------+-----------------------------------
      Total |        647      100.00

  ubecbw502 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0413437 |        518      100.00      100.00
------------+-----------------------------------
      Total |        518      100.00

  ubecbw503 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0491803 |        542      100.00      100.00
------------+-----------------------------------
      Total |        542      100.00

  ubecbw504 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0434783 |        537      100.00      100.00
------------+-----------------------------------
      Total |        537      100.00

  ubecbw505 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0353982 |        569      100.00      100.00
------------+-----------------------------------
      Total |        569      100.00

  ubecbw506 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0555556 |        589      100.00      100.00
------------+-----------------------------------
      Total |        589      100.00

  ubecbw507 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0328228 |        600      100.00      100.00
------------+-----------------------------------
      Total |        600      100.00

  ubecbw508 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0313901 |        572      100.00      100.00
------------+-----------------------------------
      Total |        572      100.00

  ubecbw509 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0491803 |        619      100.00      100.00
------------+-----------------------------------
      Total |        619      100.00

 ubecbw5010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0255864 |        594      100.00      100.00
------------+-----------------------------------
      Total |        594      100.00

 ubecbw5011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0276008 |        621      100.00      100.00
------------+-----------------------------------
      Total |        621      100.00

 ubecbw5012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0490798 |        620      100.00      100.00
------------+-----------------------------------
      Total |        620      100.00

 ubecbw5013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0351648 |        593      100.00      100.00
------------+-----------------------------------
      Total |        593      100.00

 ubecbw5014 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .021097 |        598      100.00      100.00
------------+-----------------------------------
      Total |        598      100.00

 ubecbw5015 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .039604 |        620      100.00      100.00
------------+-----------------------------------
      Total |        620      100.00

 ubecbw5016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0372549 |        648      100.00      100.00
------------+-----------------------------------
      Total |        648      100.00

 ubecbw5017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0285714 |        621      100.00      100.00
------------+-----------------------------------
      Total |        621      100.00

  ubecbw600 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0388889 |        253      100.00      100.00
------------+-----------------------------------
      Total |        253      100.00

  ubecbw601 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0419048 |        712      100.00      100.00
------------+-----------------------------------
      Total |        712      100.00

  ubecbw602 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0244444 |        581      100.00      100.00
------------+-----------------------------------
      Total |        581      100.00

  ubecbw603 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0387755 |        605      100.00      100.00
------------+-----------------------------------
      Total |        605      100.00

  ubecbw604 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .045977 |        599      100.00      100.00
------------+-----------------------------------
      Total |        599      100.00

  ubecbw605 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0334646 |        625      100.00      100.00
------------+-----------------------------------
      Total |        625      100.00

  ubecbw606 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0435644 |        626      100.00      100.00
------------+-----------------------------------
      Total |        626      100.00

  ubecbw607 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0357143 |        647      100.00      100.00
------------+-----------------------------------
      Total |        647      100.00

  ubecbw608 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0182556 |        619      100.00      100.00
------------+-----------------------------------
      Total |        619      100.00

  ubecbw609 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0444444 |        671      100.00      100.00
------------+-----------------------------------
      Total |        671      100.00

 ubecbw6010 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0249042 |        647      100.00      100.00
------------+-----------------------------------
      Total |        647      100.00

 ubecbw6011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0311284 |        664      100.00      100.00
------------+-----------------------------------
      Total |        664      100.00

 ubecbw6012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0282486 |        662      100.00      100.00
------------+-----------------------------------
      Total |        662      100.00

 ubecbw6013 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .037182 |        649      100.00      100.00
------------+-----------------------------------
      Total |        649      100.00

 ubecbw6014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0248092 |        648      100.00      100.00
------------+-----------------------------------
      Total |        648      100.00

 ubecbw6015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0251799 |        671      100.00      100.00
------------+-----------------------------------
      Total |        671      100.00

 ubecbw6016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0385965 |        708      100.00      100.00
------------+-----------------------------------
      Total |        708      100.00

 ubecbw6017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0240296 |        672      100.00      100.00
------------+-----------------------------------
      Total |        672      100.00

. 
. collapse (max) ubecbw50* ubecbw60* (mean) ubw50atbir ubw60atbir

. 
. gen eubecbw50=1-ubw50atbir

. gen eubecbw60=1-ubw60atbir  

. 
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 replace e`var'=(e`var')*(1-`var'`a')
  4.         }
  5.         tab e`var'
  6. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw50 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .2193024 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw60 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .2968996 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. local bw50=eubecbw50

. local bw60=eubecbw60

. 
. putexcel B24=(1-`bw50') D24=(1-`bw60')
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. restore

. preserve

. 
. keep if agebir1==4
(33,254 observations deleted)

. 
. local transition "ubecbw50 ubecbw60"

. 
. gen ubw50atbir=uyearbw50 if durmom==0
(9,061 missing values generated)

. gen ubw60atbir=uyearbw60 if durmom==0
(9,061 missing values generated)

.         
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 quietly egen `var'`a'=mean(`var') if durmom==`a' & `var' !=2
  4.                 tab `var'`a'
  5.         }
  6. }

  ubecbw500 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0155039 |        202      100.00      100.00
------------+-----------------------------------
      Total |        202      100.00

  ubecbw501 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0369515 |        621      100.00      100.00
------------+-----------------------------------
      Total |        621      100.00

  ubecbw502 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0723684 |        444      100.00      100.00
------------+-----------------------------------
      Total |        444      100.00

  ubecbw503 |      Freq.     Percent        Cum.
------------+-----------------------------------
       .028 |        366      100.00      100.00
------------+-----------------------------------
      Total |        366      100.00

  ubecbw504 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0367893 |        352      100.00      100.00
------------+-----------------------------------
      Total |        352      100.00

  ubecbw505 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .038961 |        386      100.00      100.00
------------+-----------------------------------
      Total |        386      100.00

  ubecbw506 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0526316 |        423      100.00      100.00
------------+-----------------------------------
      Total |        423      100.00

  ubecbw507 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0304878 |        401      100.00      100.00
------------+-----------------------------------
      Total |        401      100.00

  ubecbw508 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0319489 |        421      100.00      100.00
------------+-----------------------------------
      Total |        421      100.00

  ubecbw509 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0302013 |        399      100.00      100.00
------------+-----------------------------------
      Total |        399      100.00

 ubecbw5010 |      Freq.     Percent        Cum.
------------+-----------------------------------
     .03367 |        385      100.00      100.00
------------+-----------------------------------
      Total |        385      100.00

 ubecbw5011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0421053 |        385      100.00      100.00
------------+-----------------------------------
      Total |        385      100.00

 ubecbw5012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0244755 |        372      100.00      100.00
------------+-----------------------------------
      Total |        372      100.00

 ubecbw5013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0352113 |        378      100.00      100.00
------------+-----------------------------------
      Total |        378      100.00

 ubecbw5014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0273973 |        373      100.00      100.00
------------+-----------------------------------
      Total |        373      100.00

 ubecbw5015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0419847 |        356      100.00      100.00
------------+-----------------------------------
      Total |        356      100.00

 ubecbw5016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0501792 |        346      100.00      100.00
------------+-----------------------------------
      Total |        346      100.00

 ubecbw5017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0334572 |        350      100.00      100.00
------------+-----------------------------------
      Total |        350      100.00

  ubecbw600 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0264901 |        224      100.00      100.00
------------+-----------------------------------
      Total |        224      100.00

  ubecbw601 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0207039 |        671      100.00      100.00
------------+-----------------------------------
      Total |        671      100.00

  ubecbw602 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0566572 |        493      100.00      100.00
------------+-----------------------------------
      Total |        493      100.00

  ubecbw603 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0171821 |        407      100.00      100.00
------------+-----------------------------------
      Total |        407      100.00

  ubecbw604 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0293255 |        394      100.00      100.00
------------+-----------------------------------
      Total |        394      100.00

  ubecbw605 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0369318 |        430      100.00      100.00
------------+-----------------------------------
      Total |        430      100.00

  ubecbw606 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0437158 |        466      100.00      100.00
------------+-----------------------------------
      Total |        466      100.00

  ubecbw607 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0300546 |        439      100.00      100.00
------------+-----------------------------------
      Total |        439      100.00

  ubecbw608 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0285714 |        458      100.00      100.00
------------+-----------------------------------
      Total |        458      100.00

  ubecbw609 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0177515 |        439      100.00      100.00
------------+-----------------------------------
      Total |        439      100.00

 ubecbw6010 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .038806 |        423      100.00      100.00
------------+-----------------------------------
      Total |        423      100.00

 ubecbw6011 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0383387 |        413      100.00      100.00
------------+-----------------------------------
      Total |        413      100.00

 ubecbw6012 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0191083 |        400      100.00      100.00
------------+-----------------------------------
      Total |        400      100.00

 ubecbw6013 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0162338 |        402      100.00      100.00
------------+-----------------------------------
      Total |        402      100.00

 ubecbw6014 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0283019 |        399      100.00      100.00
------------+-----------------------------------
      Total |        399      100.00

 ubecbw6015 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0508475 |        389      100.00      100.00
------------+-----------------------------------
      Total |        389      100.00

 ubecbw6016 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0295082 |        372      100.00      100.00
------------+-----------------------------------
      Total |        372      100.00

 ubecbw6017 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0367893 |        380      100.00      100.00
------------+-----------------------------------
      Total |        380      100.00

. 
. collapse (max) ubecbw50* ubecbw60* (mean) ubw50atbir ubw60atbir

. 
. gen eubecbw50=1-ubw50atbir

. gen eubecbw60=1-ubw60atbir  

. 
. foreach var in `transition'{
  2.         forvalues a=0/17{
  3.                 replace e`var'=(e`var')*(1-`var'`a')
  4.         }
  5.         tab e`var'
  6. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw50 |      Freq.     Percent        Cum.
------------+-----------------------------------
    .153416 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

  eubecbw60 |      Freq.     Percent        Cum.
------------+-----------------------------------
   .2211347 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. local bw50=eubecbw50

. local bw60=eubecbw60

. 
. putexcel B25=(1-`bw50') D25=(1-`bw60')
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. restore

. 
. tab my_race

           my_race |      Freq.     Percent        Cum.
-------------------+-----------------------------------
          NH white |     26,482       62.15       62.15
             black |      5,801       13.61       75.76
non-black Hispanic |      6,793       15.94       91.71
          NH Asian |      2,174        5.10       96.81
          NH other |      1,360        3.19      100.00
-------------------+-----------------------------------
             Total |     42,610      100.00

. tab hieduc

     hieduc |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,807        7.22        7.22
          2 |      8,823       22.70       29.92
          3 |     13,880       35.71       65.62
          4 |     13,364       34.38      100.00
------------+-----------------------------------
      Total |     38,874      100.00

. tab yearspartner

yearspartne |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,056       26.07       26.07
          1 |     25,553       66.25       92.32
          2 |      2,964        7.68      100.00
------------+-----------------------------------
      Total |     38,573      100.00

. tab agebir1

  RECODE of |
      ageb1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      4,471       11.59       11.59
          2 |     11,121       28.83       40.42
          3 |     13,599       35.26       75.68
          4 |      9,356       24.26       99.93
         57 |          3        0.01       99.94
         58 |          1        0.00       99.94
         59 |          3        0.01       99.95
         60 |          3        0.01       99.96
         61 |          1        0.00       99.96
         63 |          3        0.01       99.97
         64 |          2        0.01       99.97
         65 |          1        0.00       99.98
         66 |          2        0.01       99.98
         67 |          2        0.01       99.99
         68 |          5        0.01      100.00
------------+-----------------------------------
      Total |     38,573      100.00

. tab uyearbw50, m

Breadwinnin |
g status (> |
       50%) |
    without |
  allocated |
       data |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,156       52.00       52.00
          1 |      7,306       17.15       69.14
          2 |     10,966       25.74       94.88
          . |      2,182        5.12      100.00
------------+-----------------------------------
      Total |     42,610      100.00

. 
. putexcel set "$results/LifetimeBreadwin.xlsx", sheet(BW50detail) modify

. putexcel B2=("Not") C2=("Breadwinning") D2=("already bw") G2=("not enter bw") H2=("cumulative survival")
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel A3="Birth" 
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. tab durmom ubecbw50, m

           |                  ubecbw50
    durmom |         0          1          2          . |     Total
-----------+--------------------------------------------+----------
         0 |     1,351         53        347        369 |     2,120 
         1 |     1,669         83        548        536 |     2,836 
         2 |     1,260         62        483        431 |     2,236 
         3 |     1,258         50        481        350 |     2,139 
         4 |     1,361         50        510        207 |     2,128 
         5 |     1,344         55        523        337 |     2,259 
         6 |     1,339         67        516        366 |     2,288 
         7 |     1,328         51        532        392 |     2,303 
         8 |     1,327         56        530        388 |     2,301 
         9 |     1,408         57        539        366 |     2,370 
        10 |     1,472         40        547        368 |     2,427 
        11 |     1,465         53        517        412 |     2,447 
        12 |     1,455         54        511        392 |     2,412 
        13 |     1,423         54        532        427 |     2,436 
        14 |     1,430         44        562        402 |     2,438 
        15 |     1,387         64        564        410 |     2,425 
        16 |     1,434         67        614        365 |     2,480 
        17 |     1,407         57        694        407 |     2,565 
-----------+--------------------------------------------+----------
     Total |    25,118      1,017      9,550      6,925 |    42,610 

. tab uyearbw50 if durmom==0, matcell(atbir50)

Breadwinnin |
g status (> |
       50%) |
    without |
  allocated |
       data |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,224       61.76       61.76
          1 |        292       14.73       76.49
          2 |        466       23.51      100.00
------------+-----------------------------------
      Total |      1,982      100.00

. putexcel B24=matrix(atbir50)
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel B3=formula(B25)
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel C3=formula(B24)
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel G3=formula(B24/(B24+B25))
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. putexcel F3=formula(B25/(B24+B25))
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. tab durmom ubecbw50, matcell(trans50)

           |             ubecbw50
    durmom |         0          1          2 |     Total
-----------+---------------------------------+----------
         0 |     1,351         53        347 |     1,751 
         1 |     1,669         83        548 |     2,300 
         2 |     1,260         62        483 |     1,805 
         3 |     1,258         50        481 |     1,789 
         4 |     1,361         50        510 |     1,921 
         5 |     1,344         55        523 |     1,922 
         6 |     1,339         67        516 |     1,922 
         7 |     1,328         51        532 |     1,911 
         8 |     1,327         56        530 |     1,913 
         9 |     1,408         57        539 |     2,004 
        10 |     1,472         40        547 |     2,059 
        11 |     1,465         53        517 |     2,035 
        12 |     1,455         54        511 |     2,020 
        13 |     1,423         54        532 |     2,009 
        14 |     1,430         44        562 |     2,036 
        15 |     1,387         64        564 |     2,015 
        16 |     1,434         67        614 |     2,115 
        17 |     1,407         57        694 |     2,158 
-----------+---------------------------------+----------
     Total |    25,118      1,017      9,550 |    35,685 

. putexcel B4=matrix(trans50)
file C:\Users\Joanna/Dropbox/Repositories/SIPP_Breadwinning/DemographySupplement//results/LifetimeBreadwin.xlsx saved

. 
. /*
> 
> sort yearspartner
> 
> by yearspartner: sum year_pearn year_hearn year_pHHearn [aweight=weight], detail
> 
> tab yearspartner yearbw50 [aweight=weight], nofreq row
> 
> tab yearspartner yearbw60 [aweight=weight], nofreq row
> 
> tab yearage yearbw60 [aweight=weight], nofreq row
> 
> tab yearage yearbw60 if yearspartner==1 [aweight=weight], nofreq row
> 
> tab yearage yearbw60 if yearspartner==0 [aweight=weight], nofreq row
> 
> *
> *
> *
> *
> *Percent never breadwinning in first 18 years of motherhood (50%, 60%)
> *
> *Total .22 .27
> *
> * Non-Hispanic White .24 .30
> * Black .13 .14
> * Non-black Hispanic .18 .23
> * Asian .32 .36
> 
> * Want estimates by educational attainment and marital status at first birth
> */
. log close
      name:  <unnamed>
       log:  C:\Users\Joanna/Dropbox\Repositories\SIPP_Breadwinning\DemographySupplement\stata_logs\yearearn_analysis_log.log
  log type:  text
 closed on:  18 Dec 2019, 15:05:27
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
